[{"title":"Default post","content":"This is the first post, it was here since the beginning.\n\n\n(Remove the space after the '[' and before the ']')\n\n  [ * [* text *] * ] [ ** [** text **] ** ] [ *** [*** text ***] *** ] [ _ [_ text _] _ ] [ *_ [*_ text _*] _* ] [ **_ [**_ text _**] _** ] [ ***_ [***_ text _***] _*** ] [ \" [\" text \"] \" ] [ # image link # ]","author":"root","comments":[{"title":"The first comment","content":"This is the first comment, it was here since the beginning.","author":"Anonymous","comments":[]}]},{"timestamp":1645977636099,"author":"reddit:ww3/big_bio_","title":"My thoughts","content":"This generation... “Please don’t start war vaddy daddy 🥺🥺🥺🥺❤️❤️❤️” Like what the hell, people are going to fucking die. Yet all the teenagers are here worried about what they will wear when the war starts. My mom is in the US Navy, and she is scared as fuck and doesn’t want to even talk about Russia. He won’t call of the invasion if we say some stupid shit and hope he will stop. And people are making memes about this which is super disrespectful as so many have already lost their homes in Ukraine yet here we are “First War, kinda nervous 😬😬😬😬 what should I wear?” Just remember, to all you fucking memers. You won’t be able to make memes anymore if Russia takes over.","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ww3/comments/t1cn2n/my_thoughts/","comments":[]}]},{"timestamp":1645977636099,"author":"reddit:ww3/Grumalt","title":"Defense Ready Condition Levels (DEFCON)","content":"https://en.wikipedia.org/wiki/DEFCON\n\nDEFCON 5: Lowest state of readiness — this is the normal state of readiness in peacetime. Code name: FADE OUT\n\nDEFCON 4: Increased intelligence watch and strengthened security measures. Code Name: DOUBLE TAKEnote\n\nDEFCON 3: Increase in force readiness above that required for normal readiness. Air Force ready to mobilize in 15 minutes — this is the first truly \"shit is about to get real\" phase of the levels. Code Name: ROUND HOUSE\n\nDEFCON 2: Conventional warfare is imminent. Armed Forces ready to deploy and engage in less than 6 hours — this is the highest level ever reached in history.note  Code Name: FAST PACE\n\nDEFCON 1: Nuclear war is imminent. Code Name: COCKED PISTOL\n\nhttps://preview.redd.it/co95dbxpi1k81.jpg?width=1200&amp;format=pjpg&amp;auto=webp&amp;s=f1000889387039561ff3abe69e16eea030b62447","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ww3/comments/t1dvlp/defense_ready_condition_levels_defcon/","comments":[]}]},{"timestamp":1645977636099,"author":"reddit:ww3/Zerkoyt","title":"What really defines a world war?","content":"Now that Estonia and Poland are backing Ukraine with supplies. What really defines the idea of “world war” countries going after other countries on a big scale? What’s the tipping point? Any opinions are welcomed","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ww3/comments/t1f5gj/what_really_defines_a_world_war/","comments":[]}]},{"timestamp":1645977636099,"author":"reddit:ww3/BigGucciMel223","title":"I wrote this a week ago for my current events class and would like to share it with y'all:","content":"WW3 ESCALATION PREDICTION:\n\nI'm predicting this scenario mostly based on the events and building blocks that occurred in the past world wars, specifically in WW2. Most predictions, the further they go into the future, the less accurate they get, so don't knock on me for predicting something deranged or unreasonable. I'll be oversimplifying and over-generalizing the process, so I don't have to sit here and write 20 paragraphs about each potential phase. History doesn't necessarily repeat, but it most definitely rhymes, so here I go: \n\nWe all know that the current geopolitical atmosphere is at its highest peak since the end of the Cold War, with Putin’s vision and goal possibly looking to reunite most if not all of the post-WW2 eastern European USSR-occupied countries once again along with the ongoing tension growing between Russia and Ukraine. It's pretty fair to say it's just a matter of time before he decides to fully move in for an invasion. With the latest build-up of Russia's military strength along Ukraine’s border, it wouldn't surprise me one bit if he gives the go anytime this month. I predict NATO, specifically the USA, responding to the invasion by only sending military aid (like it's currently doing) minus deploying American troops simply because Article 5 isn’t applicable to Ukraine. This will occur until either the fall of Kyiv, Russia occupying all of east Ukraine, or when Ukraine decides to surrender earlier before such things take place. At this point, the number of deaths caused by Russia could be approximately 50,000-100,000. The US and most of NATO will most likely not respond militarily, but I indubitably see them implementing massive sanctions on Russia, which will certainly cause economic pain primarily in Russia but also in most European countries predominantly in Germany since their so dependant on Russia for energy means, some industries in the west will as well face disruption. Much like when the Third Reich decided to invade Poland, I can’t see the US sending American troops overseas, especially given this administration's current approval rating and after spending 20 years in the Middle East gaining very little while China's economy grew to where it is today.\n\nAfter Ukraine becomes fully occupied by the Russians, I see the geopolitical atmosphere significantly intensifying but not leading to any significant military action between the world's superpowers besides sanctions continuing to be applied to the aggressors. Following this, I see Russia driving towards an established alliance with China to frighten NATO. This will back and encourage China to invade Taiwan, which they can do relatively easily and quickly even with American military aid being present in Taiwan. While China gets ready to invade after securing this alliance I can imagine Russia possibly setting up troops near Poland’s, Armenia’s, Romania’s and/or Moldova's border under the face of “running military drills'' in a very similar fashion as how we previously saw in the Ukrainian-Belarus &amp; Russian situation. This historical moment will determine whether tens of millions, if not hundreds of millions of people die in the event of WW3. Taiwan's unique alliance with America means that if it decides to protect Taiwan, the Western, European, and other powers that make up NATO will probably be forced to make a life-or-death decision quickly to decide if they will try to help in the invasion of Taiwan or not. The longer they wait, the better positioned China gets for an invasion, and the higher the estimated casualty figure rises. The attempt in invading Taiwan could be very similar to the Normandy landings but on a much bigger scale, costing an estimated 250-500K American lives in just the first few weeks of battle, not to mention the civilian deaths. Ultimately, I'm positive most, if not all, nations will agree to not do such a thing and continue placing hard sanctions on both Russia and China until article 5 officially gets infringed in any of the NATO-backed countries.\n\n\tWhen it comes to dealing with the things the Russians and China are committing, I expect the West’s population to be in a very similar situation, both politically and ideologically, as we were pre-Pearl Harbor occurring. For the few that don't know, over 80%+ of Americans didn't support the US intervening in WW2 by sending American troops being sent out to war even 2 years into WW2. The next Pearl Harbor-like moment will in all likelihood be a cyberattack or terrorist-like bombing coming from either the Chinese or Russian government, this event will undoubtedly emotionally fuel most of America’s population into agreeing to enter or start WW3. After America and all of NATO declares war on China and Russia w","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ww3/comments/t1gf5c/i_wrote_this_a_week_ago_for_my_current_events/","comments":[]}]},{"timestamp":1645977636099,"author":"reddit:ww3/TeaProfessional6582","title":"Joining the army ?","content":"I’m trying to join the army and don’t qualify because of my adhd , my recruiter told me I should get a new social security number so they don’t have my medical records . How likely will this work . I know it’s shady but I always wanted to join .","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ww3/comments/t1gxof/joining_the_army/","comments":[]}]},{"timestamp":1645977636100,"author":"reddit:ww3/No_Establishment1782","title":"Is Putin a terrorist?","content":"Id say he is!","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ww3/comments/t1h6mz/is_putin_a_terrorist/","comments":[]}]},{"timestamp":1645977636100,"author":"reddit:ww3/[deleted]","title":"join ffl while ww3 gonna happen soon","content":"ugh im 17 yo rn from malaysia. im planning to join ffl (french foreign legion) and everything just went pass thru so fast. is there any chance that i still can join ffl or it just a hope ?","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ww3/comments/t1hcbw/join_ffl_while_ww3_gonna_happen_soon/","comments":[]}]},{"timestamp":1645977636100,"author":"reddit:ww3/_ExistentiaI_Crisis_","title":"Is Canada going to war?","content":"I’ve seen so many mixed things, what’s happening? Is Canada really going to war against Russia?","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ww3/comments/t1i040/is_canada_going_to_war/","comments":[]}]},{"timestamp":1645977636100,"author":"reddit:ww3/yodisk","title":"i’m going to dumb down why the USA and other countries can’t help the Ukraine.","content":"A lot of countries are part of a group called the “NATO”s.  “nato” stands for “North Atlantic Treaty Organization”and if you’re in the “nato” you’re not supposed to defend other countries, only the ones in the “nato” group. Ukraine has tried to join “nato” but didn’t have all the right requirements to join. The USA has sent people to poland and other countries that are part of “nato” just in case Russia attacks. If Russia attacks any countries apart of “nato” there will be a world war. The “nato” is much more powerful. Russia knows this, that’s why they aren’t attacking the other countries near by because most of them are part of “nato”. The “nato” includes these countries: ALBANIA, BELGIUM, BULGARIA, CANADA, CROATIA, CZECH REPUBLIC, DENMARK, ESTONIA, FRANCE, GERMANY, GREECE, HUNGARY, ICELAND, ITALY, LATVIA, LITHUANIA, LUXEMBOURG, MONTENEGRO, NETHERLANDS, NORTH MACEDONIA, NORWAY, POLAND, PORTUGAL, ROMANIA, SLOVAKIA, SLOVENIA, SPAIN, TURKEY, THE UNITED KINGDOM, THE UNITED STATES. If you are in these countries you are most likely safe. \nStay safe everyone ❤️","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ww3/comments/t1j5c9/im_going_to_dumb_down_why_the_usa_and_other/","comments":[]}]},{"timestamp":1645977636100,"author":"reddit:ww3/GreedyCod4815","title":"Im From Ireland, how fucked are we","content":"considering that we have somewhat of a strategic value in this war due to our geographical location with trade routes and whatnot. I feel like we would be a target further down the line.\n\nalso considering that on multiple occasions \"Ireland\" has been mentioned by Russian officials and Russian battleships came 40 miles of the west coast which means mystery man joseph Putin has some thoughts in mind.\n\nthat's just me tho I'm a serial overthinker, I just cant help it","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ww3/comments/t1jzix/im_from_ireland_how_fucked_are_we/","comments":[]}]},{"timestamp":1645977636100,"author":"reddit:ww3/CrossCountryGuy1","title":"If the invasion of Ukraine doesn’t go as smoothly as Putin desires, what will happen?","content":"Do you think because he is old, he’ll just say, “fuck it,” and launch nukes?","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ww3/comments/t1ke2f/if_the_invasion_of_ukraine_doesnt_go_as_smoothly/","comments":[]}]},{"timestamp":1645977636100,"author":"reddit:ww3/Realistic_Item9564","title":"would Russia attack Sweden/Poland after Ukraine?","content":"just wanna see opinions","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ww3/comments/t1kuwj/would_russia_attack_swedenpoland_after_ukraine/","comments":[]}]},{"timestamp":1645977636100,"author":"reddit:ww3/oh_hello05","title":"what would happen if the current war between ukraine and russia spilled over into nato territory?","content":"Like, if it were accidental (I know that sounds stupid but whatever), would the outcome be the same as if Russia attacked nato area on purpose?\n\nI'm heartbroken, crying, praying for Ukraine all the time. I can't imagine their feelings right now :(","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ww3/comments/t1lo5l/what_would_happen_if_the_current_war_between/","comments":[]}]},{"timestamp":1645977636100,"author":"reddit:ww3/stefanbolcs9111","title":"very afraid, what would you do","content":"I am very afraid here from slovakia what will happen in the next days, if NATO gets involved we all have to go to war and it will be a very sad and cruel part of history. What should I do, take my relatives and flee to the west,  am I having paranoia? honest answers please","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ww3/comments/t1n2mt/very_afraid_what_would_you_do/","comments":[]}]},{"timestamp":1645977636100,"author":"reddit:ww3/Plantmanofplants","title":"Russia's next move.","content":"In my opinion the likelihood of Sweden and Finland joining NATO is fairly high. Putin has a time limit on his conquest dreams and he already has his army mobilized. What's the likelihood of shit hitting the fan over the next few months. I'm in Ireland so ground conflict probably isn't the most likely but we have a couple substantial targets that would be early on the list.\n\n Have their been any murmurs of China moving any planned assault ok Taiwan up and what will happen to the rest of the ex union now that Kazakhstan, Belarus and Azerbaijan have joined Russia?","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ww3/comments/t1njrt/russias_next_move/","comments":[]}]},{"timestamp":1645977636100,"author":"reddit:ww3/Autumnfayee","title":"The Similarities between Hitler and Putin","content":"Hitler invaded Poland after he said he wouldn’t. Then claimed he did it just to get his land back. Then within 6 months invaded the EU. This started WW2. Putin is invading Ukraine to “get land back” and “free them from nazi regime”. Does he have backing now? No. But Hitler didn’t either in the beginning. I really believe that China and North Korea will side with Russia. I predict that we are on the precipice of WW3 within the next year or less. I don’t think it will be a Nuclear War that ends the world. But I do think it’ll be bigger than WW2 and spill onto American soil eventually.","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ww3/comments/t1o6r2/the_similarities_between_hitler_and_putin/","comments":[]}]},{"timestamp":1645977636100,"author":"reddit:ww3/bombf11bye","title":"Was this the second part of something big?","content":"I'm mean first part would be china unleashing the covid and inflation skyrocketing in the u.s \n\nThe u.s got fucked by covid , yes the whole world did but it fucked the u.s really bad\n\nLook at the metrics u.s is 30 trillion in debt and approximately 1 million people are dead due to the illness and still rising because of ignorant anti vacc people and the mutations Poppin off every now and then\n\nIf this is the likely scenario and ww3 has already started what will the part 3 be?","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ww3/comments/t1oqss/was_this_the_second_part_of_something_big/","comments":[]}]},{"timestamp":1645977636100,"author":"reddit:ww3/Ghostkie-2005","title":"Go Ukraine!","content":"I think I can speak for everyone when I say that Russia's army, and President Putin, Go F\\*\\*\\* yourself.","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ww3/comments/t1p1dk/go_ukraine/","comments":[]}]},{"timestamp":1645977636100,"author":"reddit:ww3/slimsshadys","title":"If things don’t go Putin’s way, what will he do?","content":"I’m seriously wondering since the Ukrainians are putting up a good fight against Putin’s military, and  if it keeps going this way and things don’t work out for Putin and he gets pissed off, what is he going to do? Will he get into a fit of rage and bomb on Ukrainian cities? Is there a possibility that the government can remove him from power? It’s a lot to think about. I just want your thoughts. Hopefully he doesn’t become so pissed off that he’ll drop nukes on Ukraine. I personally believe that Putin is officially out of his mind. Something has to be done and he needs to be stopped. I hope the U.S. and other countries are considering cutting Russia off from SWIFT. Can’t believe in 2022 the whole world is witnessing this shit.","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ww3/comments/t1qiai/if_things_dont_go_putins_way_what_will_he_do/","comments":[]}]},{"timestamp":1645977636100,"author":"reddit:ww3/Sea-Illustrator-9097","title":"To those who want to help Ukraine in any way, join r/AidForUkraine","content":"r/AidForUkraine\n\nHelp comes in many different forms. From donating money, to traveling and giving a hand to those already there. \n\nIt takes a united front to handle a crisis; be part of that front","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ww3/comments/t1r5wk/to_those_who_want_to_help_ukraine_in_any_way_join/","comments":[]}]},{"timestamp":1645977636100,"author":"reddit:ww3/TheNewTimeGamer","title":"Very worrying stuff I compiled about the false flag 'dirty bomb' threat","content":"https://www.reddit.com/r/UkrainianConflict/comments/t18m1j/exclusive_i_have_been_given_a_copy_of_document/hyez9vd/?context=3\n\nI don't know where else to post this, my comment is on a dead thread and I feel like it needs to be spread.\n\nRussia send out a massive message about the readying of medical personnel for relocation for a massive medical emergency.\n\nIntel suggested yesterday that a massive false flag was planned.\n\nNow this dirty bomb stuff.\n\nI hope I am wrong.","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ww3/comments/t1y749/very_worrying_stuff_i_compiled_about_the_false/","comments":[]}]},{"timestamp":1645977636100,"author":"reddit:ww3/thoughtfulsoul10000","title":"Earth population is over 7.7 billion, but I heard that if a nuclear war happens, that only 500 million would survive, do you think you would?","content":"Earth population is over 7.7 billion, but I heard that if a nuclear war happens, that only 500 million would survive, mostly in Africa and south America, but ofc some people will survive in other parts of the world, do you think you would?\n\nEdit: I think if ww3 happens, me, everyone I've ever known, and certainly everyone that reads this post (pre ww3) will be dead. The odds are not in our favor, so I really hope it doesn't happen. I know some people are hoping it does, which is dumb. Anyways if somehow it does happen, and someone recovers the internet in the future, and by some slim chance sees this post, I want to say:\n\nThe world is yours now, don't judge us idiots who came before you, most of us had no choice in our fate. Anyways, be kind to each other, and do better than we did!","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ww3/comments/t22mem/earth_population_is_over_77_billion_but_i_heard/","comments":[]}]},{"timestamp":1645977636100,"author":"reddit:ww3/Dangerous-Ad-1008","title":"What if Ukraine Wins","content":"Imagine\n\nUkraine turns back Russia. Russian military is defeated and their economy is shattered.\n\n&amp;#x200B;\n\nIts April. NATO members see their chance to remove Putin from power and end their reliance on Russia's natural resources.\n\nThe US and her NATO allies go on the offensive and invade Russia. The Russians are steam rolled as they were unprepared for such an attack.\n\nRussians burns all their land and destroy their roads as the allies drive east towards Moscow. Dedicated Russian civilians and military act as a rearguard as the general population flees, causing significant delays and casualties. Resistance is met at every major city. Occupation proves futile, being too costly and ineffective.\n\n&amp;#x200B;\n\nAllies reach Moscow late summer but find a well dug in and fortified capital city. A long and costly siege begins. The allies expecting a weak and demoralized Russian military is surprised and repelled by fierce resistance. Defending your home is more motivating than taking somebody else's.\n\n&amp;#x200B;\n\nBelarus starts attacking NATO supply chains and another front in the war is opened. The allies, hoping to skirt around Belarus and attack through Ukraine now have to contend with another nation. \n\n&amp;#x200B;\n\nWinter is coming.\n\n&amp;#x200B;\n\nRussian and Chinese men and material arrive from the east. The US urges her allies in Japan and South Korea to attack China to distract and weaken her. \n\nBut these nations are too small to take on the behemoth that is now China. They do nothing. Australia approaches from the south but their navy is ineffective. Should've went with French hardware.\n\nChina does not launch attacks of her own but is instead content to hold her ground on her eastern and southern flank. \n\n&amp;#x200B;\n\nFrustrated, running low on supplies and morale, the Allies start blaming each other for the delays and failures. Communications and military cohesion break down. They launch uncoordinated and ineffective small scale attacks. \n\nDesperate, the Allies launch one last attempt to take Moscow. Russians citizens willingly sell their lives in defiance.\n\nReinforcements arrive and easily see the attackers off. \n\n&amp;#x200B;\n\nWinter is here. \n\nSensing the tides have turned, the Allies make a poorly coordinated retreat. The ground is a quagmire. The roads still broken. The whole of the Allied attack force is bottlenecked, having to travel through Ukraine.\n\nThe Russians catch up. Stragglers are cut down, their meager supplies taken. \n\nThe great northern European plain makes invading an easy task. Slowly, smaller countries surrender. Russians invade Poland's plains in a day. Germany surrenders and casts their lot with the Russians. \n\nThe French hastily reinforce the historic but still effective Maginot Line. However, this gets swept away. French Resistance is no match for the Russian Rampage. \n\n&amp;#x200B;\n\nThe last remaining great power in Europe is Britain. Her geographical features make her an impenetrable island fortress. \n\nRussia uses her defeated foe's men and material to wear down Britain. Reluctant pilots and soldiers are press-ganged into fighting. The lives of their loved ones threatened. Russia targets the military airfields and infrastructure. Britain launches attacks on civilian targets but Putin does not take the bait.\n\nWith little naval and air defense left, Russia's little green men land on the beaches. The Brits fight and resist at every level. But it is not enough. Having the military resource of a continent thrown at an island is too much to defend against. After fierce resistance, the UK capitulates. \n\n&amp;#x200B;\n\nThe US is the last bastion of hope and democracy. Emperor Trump overthrows Biden and retakes his throne.","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ww3/comments/t23gkp/what_if_ukraine_wins/","comments":[]}]},{"timestamp":1645977636100,"author":"reddit:ww3/Jlp800","title":"If actual WW3 breaks out, how would US be affected?","content":"If an actual WW3 Broke out, IMO USA would be largely unaffected in “normal” terms. I would say majority of attacks directed at the mainland would be cyber. Attacks of banking, power, and infrastructure systems. Not to say it wouldn’t be bad, but I don’t think we’d experience much in terms of normal violence. But our day to day would be heavily affected. What’s y’all’s opinion on how we would be affected here at home?","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ww3/comments/t24ddk/if_actual_ww3_breaks_out_how_would_us_be_affected/","comments":[]}]},{"timestamp":1645977636100,"author":"reddit:ww3/medigruber","title":"Will the sanctions provoke Putin even more?","content":"Do you think all those sanctions and cyber attacks will provoke Putin even more, so he will create more false flags/more bombings? Or even use nukes?","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ww3/comments/t24vvi/will_the_sanctions_provoke_putin_even_more/","comments":[]}]},{"timestamp":1645977636100,"author":"reddit:ww3/tokyo_reveng","title":"This may happen","content":"Hello, am from Latvia, and I'm scared, because if  Russia wins agents Ukraine, Putin may target the  Baltic States or other countries near. That may happen in the near future.","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ww3/comments/t259oh/this_may_happen/","comments":[]}]},{"timestamp":1645977636100,"author":"reddit:ww3/Longjumping-Cheek-63","title":"What if putin takes Ukraine?","content":"I want to know what he would do if he takes Ukraine. Invade other countries?","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ww3/comments/t25sfj/what_if_putin_takes_ukraine/","comments":[]}]},{"timestamp":1645977636100,"author":"reddit:ww3/ClippTube","title":"Want to help keep major Russian websites down?","content":" https://norussian.tk/ \\-- a website that is purely HTML and can be hosted locally to help protect privacy.\n\nThis website actively requests to around 20 major websites including: Sberbank (one of Russia's largest banks), Kremlin, RT, RIA (russian official agencies), rbc, 1tv and more. All you need to do is keep this tab open and you'll be putting a lot of stress on these websites. Most of these websites are already down but may as well keep them down!\n\nNote: Some users have experienced issues with this, you are welcome to try hosting this yourself (copy the html from the website and create a new notepad document, paste it all in there, and save as a (.HTM) file. Or you are welcome to try using VPNs. There are other similar variants to this site that can also be used.","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ww3/comments/t26z5t/want_to_help_keep_major_russian_websites_down/","comments":[]}]},{"timestamp":1645977636100,"author":"reddit:ww3/AdministrativeAd3511","title":"Very confused","content":"Why can't russia just go in hard hes being such a pussy. If he doesn't amd somehow backs down that's sad af😂😂😂😂. How would ukraine beat them its embarrassing for him","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ww3/comments/t2995q/very_confused/","comments":[]}]},{"timestamp":1645977636100,"author":"reddit:ww3/taSentinel137","title":"WW3 Nuclear War Survival Skills","content":"Given the surprising and rapidly escalating situation between Russia and Ukraine (and by extension the West), it is prudent to bring the following WW3-related civil defense manual back to widespread public knowledge and circulation:  \n\n\n**Nuclear War Survival Skills** by Cresson Kearny, **which is in the public domain** and can be found online for free. This book has its own wikipedia article!\n\nhttps://en.wikipedia.org/wiki/Nuclear_War_Survival_Skills\n\nIt can be found for example at the following websites, among many other places. There is no intended promotion of affiliation with the content of these sites:\n\nhttps://www.survival.ark.net.au/Nuclear-War-Survival-Skills.pdf\n\nhttps://www.survivorlibrary.com/library/nuclear-war-survival-skills.pdf\n\nThe \"About the Author\" and \"Forward\" are written by the late respected physicists Eugene Wigner and Edward Teller, the so called Father of the Hydrogen Bomb.  Please consider the significance that they would lend their names to this manual.\n\nYou should have this saved as a pdf and ideally printed. Please share it with everyone you know who would be receptive to even just saving a copy on a computer or mobile device.\n\nStart by reading the Introduction section and Chapters 1 and 2, (about 16 pages total) which may help you to understand why you would want to bother reading a book like this.  **Chapter 1 is the bare minimum.**\n\nThe sender of this message does not believe nuclear war is eminent but does believe that the risk of accidental nuclear war is in the process of increasing. Even a global nuclear war is very likely a survivable event for humanity but the conditions of that survival depend on the education and awareness of citizens about what to expect should this catastrophe come to pass.","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ww3/comments/t2aisg/ww3_nuclear_war_survival_skills/","comments":[]}]},{"timestamp":1645977636100,"author":"reddit:ww3/EricTeKing","title":"Ghost of Kiev Conspiracy","content":"Correct me if I'm wrong, I'm dumb but the ghost of kiev pictures on the internet have different numbers on their jets. What if they were a group of jets...","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ww3/comments/t2ax79/ghost_of_kiev_conspiracy/","comments":[]}]},{"timestamp":1645977636100,"author":"reddit:ww3/Spygaming1","title":"I have a question","content":"Will russia bomb the UK? I live in the UK and I'm afraid russia is going to bomb us. Even though in in northern Ireland I'm still scared.","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ww3/comments/t2b3jk/i_have_a_question/","comments":[]}]},{"timestamp":1645977636100,"author":"reddit:ww3/CrossCountryGuy1","title":"https://apnews.com/article/russia-ukraine-united-nations-general-assembly-kyiv-boris-johnson-business-2db2e7aeab196d941e7b66492feca14b","content":"This doesn’t mean anything, right?\n\nhttps://apnews.com/article/russia-ukraine-united-nations-general-assembly-kyiv-boris-johnson-business-2db2e7aeab196d941e7b66492feca14b","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ww3/comments/t2biyw/httpsapnewscomarticlerussiaukraineunitednationsgen/","comments":[]}]},{"timestamp":1645977636100,"author":"reddit:ww3/fallingdownxp688","title":"This is just the conspiracy in me talking","content":"Im not downplaying anything that’s happening in Ukraine right now, it’s terrible and I can’t imagine what they are going through.  But do you guys think this is some Global elite planning stuff for depopulation? It’s starting in Ukraine but eventually could head to Baltic states, US, UK till we’re all done for. \n\nI understand Russia and Ukraine have history and they’ve invaded before, but was it like this at that time also? In 2014/2008?  I was young so I didn’t even know what was going on back then. Was News pushing it this hard this back then also everyday?\n\nI wanna say Putin isn’t crazy or stupid enough to hit Baltic states or a NATO country cause then that’s 30 countries on his ass and Russia is done for but idk, do y’all think this could escalate? Would he be crazy enough? Could this all lead to a one world government? What do you think? Praying for Ukraine also 🙏","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ww3/comments/t2cvf1/this_is_just_the_conspiracy_in_me_talking/","comments":[]}]},{"timestamp":1645977636100,"author":"reddit:ww3/AdministrativeAd3511","title":"Thoughts on this new update In last hour","content":"French President Emmanuel Macron asks his Belarus counterpart to demand that the country, Ukraine’s neighbor, quickly order Russian troops to leave, claiming Moscow has been given the green light to deploy nuclear arms there.\n\nIn a phone conversation, Macron denounces “the gravity of a decision that would authorize Russia to deploy nuclear arms on Belarus soil,” a statement by the presidential palace says.\n\nMacron told Alexander Lukashenko that fraternity between the people of Belarus and Ukraine should lead Belarus to “refuse to be a vassal and an accomplice to Russia in the war against Ukraine,” the statement says.\n\nBelarus was one one of several axes used by Russia to launch attacks on Ukraine, with Belarus the point to move toward the capital Kyiv, a senior US defense official has said.\n\nMacron has pushed persistently to try to claw out a ceasefire amid the war, using the telephone to talk to all sides, diplomacy and sanctions by the European Union.","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ww3/comments/t2dokb/thoughts_on_this_new_update_in_last_hour/","comments":[]}]},{"timestamp":1645977636100,"author":"reddit:ww3/Manic_grandiose","title":"Was the recent UK earth quake really an underground nuke test? It happened a few days ago.","content":"Or am I paranoid?","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ww3/comments/t2f8ml/was_the_recent_uk_earth_quake_really_an/","comments":[]}]},{"timestamp":1645977636100,"author":"reddit:ww3/Aggravating-peach1","title":"Fox and FBI claims that Russia has just launched massive Cyber attack against US","content":"Fox reports that Russia has just launched a massive cyber attack against the US they are in our data base and changing your password will do nothing FBI released a statement on Fox about it","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ww3/comments/t2kfqg/fox_and_fbi_claims_that_russia_has_just_launched/","comments":[]}]},{"timestamp":1645977636100,"author":"reddit:ww3/UniversalSurvivalist","title":"Poll on going to war (WW3)","content":"SS: Would you fight for billionaires, politicians or the elites if the West went to war with China or Russia? \n\nWould you stop an invasion force if the invaders promised to only target elites?\n\nhttps://www.reddit.com/poll/t2l2bp","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ww3/comments/t2l2bp/poll_on_going_to_war_ww3/","comments":[]}]},{"timestamp":1645977636100,"author":"reddit:ww3/waldwilduk","title":"Do we really believe in bad and good countries?","content":"Dont we all realise that all countries look at their sefl interest and never help others unless it's in their interest? Why do we think anything differnt here?","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ww3/comments/t2lj1z/do_we_really_believe_in_bad_and_good_countries/","comments":[]}]},{"timestamp":1645977636100,"author":"reddit:ww3/imkdawgg","title":"Can I do something?","content":"I am a 14 year old male who's not very fit but I don't have much to lose I don't have many friends the girl I love doesn't love me back and never will I don't have good grades and I'm not very Smart I wish to put my useless life to good and do something is there any way I can help Ukraine I would gladly go out and fight for them if I could even if I could only take down one person that's one less person to harm others or even if I died without taking out anyone that's one less bullet to harm someone else like I said I don't have much to lose so I'd rather die a hero then keep being useless the whole world could be at stake and I would like to help please is there any way","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ww3/comments/t2mzng/can_i_do_something/","comments":[]}]},{"timestamp":1645977636100,"author":"reddit:ww3/A_nervous_teenager","title":"Do you think Russia will not be able to capture Kyiv?","content":"I know Russia has superior numbers, but their performance is terrible. Ukrainian citizens and soldiers are able to easily stop russian armoured vehicles, destroy convoys, and capture soldiers. The Russians are losing an order of magnitude more soldiers than Ukraine, despite being 2nd biggest military of the world. Based on the economic losses already faced, do you think Russia will stop the invasion before capturing Kyiv?  Because Ukrainians are doing an amazing job of defending themselves.","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ww3/comments/t2nzga/do_you_think_russia_will_not_be_able_to_capture/","comments":[]}]},{"timestamp":1645977636100,"author":"reddit:ww3/LatterConcentrate6","title":"Vladimir Putin puts Russia’s nuclear deterrence forces on high alert","content":"https://www.theguardian.com/world/2022/feb/27/vladimir-putin-puts-russia-nuclear-deterrence-forces-on-high-alert-ukraine","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ww3/comments/t2ozt1/vladimir_putin_puts_russias_nuclear_deterrence/","comments":[]}]},{"timestamp":1645977636100,"author":"reddit:ww3/ShotBot","title":"Putin puts Russia’s nuclear forces on alert, cites sanctions","content":" \n\nhttps://apnews.com/article/russia-ukraine-kyiv-business-europe-moscow-2e4e1cf784f22b6afbe5a2f936725550\n\nKYIV, Ukraine (AP) — In a dramatic escalation of East-West tensions over Russia’s invasion of Ukraine, President Vladimir Putin ordered Russian nuclear deterrent forces put on high alert Sunday in response to what he called “aggressive statements” by leading NATO powers.\n\nThe order means Putin has ordered Russia’s nuclear weapons prepared for increased readiness to launch, raising the threat that the tensions could boil over into a nuclear war. In giving it, the Russian leader also cited hard-hitting financial sanctions imposed by the West against Russia, including Putin himself.","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ww3/comments/t2p82i/putin_puts_russias_nuclear_forces_on_alert_cites/","comments":[]}]},{"timestamp":1645977636100,"author":"reddit:ww3/randomusername11222","title":"Zelensky should be eliminated","content":"Zelensky should be eliminated, it's a pain in the ass, always dragging other states into things, which will enevirably follow to not delude their dumbfucks, which by consequences will escalate each time tensions by both parties\n\nI don't give a shit on who wins, I just feel annoyed by tensions, if you want that everyone should share your social identities, good I don't care, but then if you're pushing everyone to precipice, then that's a problem\n\nFirstly they say that they won't support Ukraine, next that they will only check the borders, now that they will send weapons, money and various sort of support, and that's not helping right? Or then sanctions, only usefull to increase the internal politic morale","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ww3/comments/t2qlq2/zelensky_should_be_eliminated/","comments":[]}]},{"timestamp":1645977636100,"author":"reddit:ww3/khayallius","title":"Preparations for war","content":"In cities in China, Korea and Japan, all government employees have been instructed to:\n\n 1. Buy cereals, rice, buckwheat with the money you have.\n\n 2. Vacationers, those on maternity leave, must not leave the area where they live without notice, and must report to the institution where they work every evening.\n\n 3. Documents must be collected in one place, within reach of the summoned and escaped.\n\n 4. Any writer who writes about peace, fatigue, or the economy will be prosecuted.\n\n 5. Soviet-era bunkers must be reopened, repaired, and maintained.\n\n By the way, the news about the readiness of the bunkers also comes from Kazakhstan and Kyrgyzstan.  Both countries have started collecting food.","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ww3/comments/t2qpuv/preparations_for_war/","comments":[]}]},{"timestamp":1645977636100,"author":"reddit:ww3/Possible-throwaway-","title":"Russia tries to invade NADO, American Truck Drivers are trying to quickly head home to stock up on necessities.","content":"America could be joining the War in less than 20 hours.","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ww3/comments/t2qtam/russia_tries_to_invade_nado_american_truck/","comments":[]}]},{"timestamp":1645977636100,"author":"reddit:ww3/EmbezzleMan","title":"If Russia uses nuclear weapons against Ukraine, would this prompt a military response from other countries?","content":"Obviously other countries are holding off on direct military involvement at the moment, but Russia decides to use nuclear weapons against Ukraine in any capacity, would this prompt a mandatory response from any other countries or would it still be their choice as to whether to get involved?\n\nYes, i'm aware Russia wish to take over and not destroy Ukraine. I'm just curious what would happen if nuclear weapons were used, or even chemical weapons?","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ww3/comments/t2r1wa/if_russia_uses_nuclear_weapons_against_ukraine/","comments":[]}]},{"timestamp":1645977636192,"author":"reddit:ukraine/JMTyra001","title":"Things I Keep On My Shelf","content":"Things I Keep On My Shelf\n\nAll open source, or available cheap online via Amazon et al. \n\nUS Army Publications\n\nFM 3-21.8- The Infantry Rifle Platoon and Squad. Resource for individual and small unit tactics, etc. Also contains tactics, techniques, and procedures for urban combat. Formerly FM 7-8.\n\nSee also: TC 3-21.76- Ranger Handbook\n\nFM 3-34.214- Explosives and Demolitions. Resource for identifying and handling munitions, improvised devices, and instructions for destroying things, including tanks, roads, bridges, buildings.\n\nSee also: US Army Improvised Munitions Handbook\n\nFM 3-11.5- NBC Decontamination. Better to have and not need than need and not have.\n\nFM 5-34- Engineer Field Data. Resource for a variety of technical details, planning factors, designs, and much more. Want to know how much a tank weighs, how much sand to build a bunker, or how much TNT you need to crater a road? This is your book!\n\nSTP 21-1- Warrior Skills Level 1. Resource for learning (or teaching) basic soldier skills like individual movement, basic first aid, marksmanship, etc.\n\nGood hunting, comrades.","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ukraine/comments/t2qajq/things_i_keep_on_my_shelf/","comments":[]}]},{"timestamp":1645977636192,"author":"reddit:ukraine/Grumbelbum","title":"From Finland to Ukraine","content":"Sorry if this is against rules, and sorry for our government for doing little.  \nThis however, goes to all people of Ukraine. You are not alone!\n\n https://www.youtube.com/watch?v=hnGIU6Q5sMI","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ukraine/comments/t2qhlw/from_finland_to_ukraine/","comments":[]}]},{"timestamp":1645977636192,"author":"reddit:ukraine/a_bit_curious_mind","title":"Russian bitten warriors back from Kharkiv share the news (in ruskie)","content":"Audio from intercepted radio talk  \nhttps://www.facebook.com/100000659128651/videos/1319661211849342/","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ukraine/comments/t2qhnr/russian_bitten_warriors_back_from_kharkiv_share/","comments":[]}]},{"timestamp":1645977636192,"author":"reddit:ukraine/BantyRed","title":"Are we going to talk about Putin's nukes?","content":"https://www.bbc.com/news/live/world-europe-60542877\n\nPutin said he wasn't going to invade Ukraine but here we are. What solution is there if Putin decides failure is not an option and throws the entire global chessboard on the floor? Is he going to nuke Ukraine or all NATO allies? If Russia has already lost, and he sees it that way will he really have a hard time deciding if he can't win no one can?","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ukraine/comments/t2qkl5/are_we_going_to_talk_about_putins_nukes/","comments":[]}]},{"timestamp":1645977636192,"author":"reddit:ukraine/Jakeonix11","title":"Redditors of Ukraine! I may have a theory why Putin is acting this way. You may want to consider my theory. He may be suffering a health condition to which it affects his mind. Last 2020, these are the links. https://www.google.com/amp/s/www.dailymail.co.uk/news/article-8970989/amp/Vladimir-Putin-un","content":"I believe his actions are not of a healthy mind but like suffering from a terminal illness or somesort.\nWhat ever he is doing is like a race against time. \n\nAnyways, I fully support Ukraine as sovereign state.\n\nHere is another... Please confirm.\nhttps://www.google.com/amp/s/www.dailymail.co.uk/news/article-8970989/amp/Vladimir-Putin-underwent-surgery-cancer-February-critic-claims.html","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ukraine/comments/t2ql6t/redditors_of_ukraine_i_may_have_a_theory_why/","comments":[]}]},{"timestamp":1645977636192,"author":"reddit:ukraine/_Spitfire024_","title":"I have a question","content":"I’m Algerian, not Ukrainian so unfortunately I do not own a Ukrainian flag. Will it be offensive to bring my flag ( Algerian) to a protest about Ukraine?","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ukraine/comments/t2ql8c/i_have_a_question/","comments":[]}]},{"timestamp":1645977636192,"author":"reddit:ukraine/Alex_Venous","title":"Peacetalk is being planned!","content":"Putin and Zelenskiy have decided to send 2 representatives to discuss possible peace. \"High alert\" nuclear deterrence is actually somewhat of a tactic for peacekeeping.\n\nSkynews report from an hour ago on YouTube, check it out.\n\nI am not claiming this will lead to anything, most likely not. but we all can have a tiny bit of hope.\n\nhttps://youtu.be/Kp4CV18JCFo","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ukraine/comments/t2qoni/peacetalk_is_being_planned/","comments":[]}]},{"timestamp":1645977636192,"author":"reddit:ukraine/Lord-Herek","title":"Question: What happens if Putin is found guilty by the Hague Tribunal?","content":"How much power Hague Tribunal actually has? \n\nWhat could happen to Putin and the people closest to him if the are found guilty of war crimes?","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ukraine/comments/t2qrgu/question_what_happens_if_putin_is_found_guilty_by/","comments":[]}]},{"timestamp":1645977636192,"author":"reddit:ukraine/daneslord","title":"HELP","content":"My grandmother is a black sea German (I speak zero Ukrainian, but my German is pretty good) and I'm trying to get her out. The rest of the family lives in Germany and I can't get in contact with her. We used to talk every other day, but her phone isn't working any more. What can I do? My parent's are dead, so I'm basically all she has. I know you're being invaded by the second coming of Hitler, but are there any tips you have?","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ukraine/comments/t2qu4b/help/","comments":[]}]},{"timestamp":1645977636192,"author":"reddit:ukraine/PerfectReplacement36","title":"Good news!","content":"Croatia just closed airspace for Russian cunts","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ukraine/comments/t2qwpv/good_news/","comments":[]}]},{"timestamp":1645977636192,"author":"reddit:ukraine/meshreplacer","title":"The next 72 hours is critical for the future of Russia","content":"We are in DEFCON 2. This means the PALs are ready for yield and coding the Physics package. This means we are hot and ready, one EAM away from either a counterforce or countervalue or both option strike.\n\nPutin is mentally unfit to lead his country, he is most likely entering a psychotic phase and would rather commit global murder suicide than lose face. The only hope we have left is if his leadership takes him out of play and replaces him with someone of sound mind and leadership capability.\n\nThe next 72 hours will be super critical. Putin is mentally unfit to lead and will just result in the self-destruction of Russia. You cannot let one man control the future of Russia like this. Time is now to remove Putin from power and replace him with a mentally fit leader who can bring Russia back from the bring of self-destruction.\n\nRussian solders, you do not have to take orders that are criminal in nature from a mentally unfit leader. You are being sent to death in Ukraine in order to kill your brothers and sisters. Do not do this for a Madman who will destroy your country and have your families in Russia suffer the consequences.\n\nThe best thing to do is surrender with your compatriots in Ukraine. You will be treated with respect and humanely. There is word of offering citizenship to Russians who surrender this illegal war.\n\nPut a white flag on the hood of the vehicle. On Tanks cover the turret with a white flag and cover periscopes and sighting systems with white opaque covering. White flags are critical to be identified as surrendering.\n\nIt is a dishonor to commit crimes, killing your compatriots in Ukraine. Surrender with honor and be remembered as those who chose good instead of evil. Remember you are Russian soldiers not Putins mercenaries.\n\nTime is ticking.","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ukraine/comments/t2qyh6/the_next_72_hours_is_critical_for_the_future_of/","comments":[]}]},{"timestamp":1645977636192,"author":"reddit:ukraine/l0sts0ul2022","title":"Will oligarchs turn on Putin?","content":"For years now its been well established that Putin hid his billions (estimated at $250b) using off shore accounts and oligarchs who 'held' the money based on a hand shake (and the knowledge that if they double crossed him they end up ingesting plutonium). As his finances are coming under attack and those same oligarchs who have enjoyed the high life watch their money, mansions, super cars and yachts be sanctioned and possessed, what are the chances that they sell him out? https://news.sky.com/story/ukraine-crisis-hit-list-of-russian-oligarchs-drawn-up-as-vladimir-putins-allies-warned-over-mansions-and-private-jets-12553214","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ukraine/comments/t2qz9i/will_oligarchs_turn_on_putin/","comments":[]}]},{"timestamp":1645977636192,"author":"reddit:ukraine/russianspb","title":"[Analysis] As a Russian, I want to warn everyone about Russia's next steps. This war could last for months. You overestimate the factor of domestic support. Russia surely is sending more and more troops and has some more unexpected tricks in the sleeve.","content":"I truly hope I am mistaken, but this is the situation from the inside of Russia the way I see it. It's a bit depressive.\n\nAs a Russian, I think most of you overestimate the factor of domestic support. People in Russia would not protest. Kill half of the army that has gathered around the borders of Ukraine - our streets will be empty. These unlucky mothers are all scattered across this huge country and will be unable to form any protest groups. Instead there will be huge lines to withdraw cash from ATM's. For the past 22 years Russia has created such a mythological way of thinking inside Russian brains that no logic could overcome it. Whole population was traumatized after the USSR collapse, and then later was fed with such nonsense in order to cope with pain that 90% of people are in an astonishing amount of denial here. Russia is ready to sacrifice as much soldiers as needed in order to achieve all these armchair geopolitical goals. Russians think this is a sacred war against Nazis, and this country is used to throw young bodies into war machines. Doesn't matter many will die. Women will give birth to new soldiers. Russia does not suffer casualties. Russia enjoys them. \n\nI doubt Russia thought they will capture Ukraine in a few days. They knew it's a huge country. As many of you note Russia has only sent around 30% of the army. More are on the way. In their way of thinking, Ukraine must fall at any price. All these huge columns with MLRS - who do you think it will be targeted at? Ukrainian army standing in an open field? All these huge lines of tanks piling up? You think it will be used against Ukrainian tanks? Heavy flamethrowers systems? How exactly were they planning to use that WMD-like weapon? I am afraid all these things will be used to destroy Ukrainian cities and infrastructure. What Russia truly needs is a dead land to ensure that this country will have no future for the next 20 years. It's a punishment because they misbehaved. In Russia we say \"так достаньсяж никому\" - means \"if I can't get you, no one will\". It means that I will destroy you so no one will ever have you. You can't possibly imagine the amount of Russian fixation about Ukraine. Russia is a crazy borderline stalker and they can't get over. It can only be stopped with brutal force. This is a pill that is really hard to swallow for US and EU.\n\nToday the Russian president said that Western \"sanctions are not legitimate\". Is that even a sentence? They went so deep down into their echo chamber they no longer make sense. They still report 0 losses. Today Russian president also ordered Russian deterrence forces that include nuclear missiles to switch to a special mode of service - basically they are now more ready. While it's purely a propaganda, it also shows that they are ready to escalate as much as needed. And they will. If they realize they are failing in Ukraine, God knows what comes to their mind. They will truly believe it's because some blackwater/academi is fighting in Donbass, and NATO soldiers are also helping to defend Kyiv. They will actually think they are already fighting with American soldiers and it's time to strike back.\n\nRussia has always been full of tricks. The next step will surprise you. Even if all these tricks fail they will seek revenge and will do everything to find the means in order to punch you in the face. Beware of that. Ukraine must fight fiercely if they want to survive. EU must act decisively if they don't want to have another Syria literally zero kilometers from them. US has all the power to fight a raging war without a bullet fired if they want to actually help.","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ukraine/comments/t2r1yb/analysis_as_a_russian_i_want_to_warn_everyone/","comments":[]}]},{"timestamp":1645977636192,"author":"reddit:ukraine/KillerDonuts27","title":"Warning to Ukrainian citizens","content":"NDSC secretary Danilov warns citizens in Bucha do not take any buses \"for evacuation\" as Ukrainian authorities not conducting such, it is Russian operation to take hostages  https://liveuamap.com//en/2022/27-february-ndsc-secretary-danilov-warns-citizens-in-bucha","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ukraine/comments/t2r3gh/warning_to_ukrainian_citizens/","comments":[]}]},{"timestamp":1645977636192,"author":"reddit:ukraine/ForgetThisNickname","title":"To sane Russians","content":"(In my previous posts of this someone kindly translated this into russian, see below)\n\nThis is addressed to any Russian involved in fights on Ukraine, to frontline soldiers, to Russians at home whose sons, husbands and friends are dying on Ukraine, to anyone who can do little something to make this stop.\n\nThis is complete madness. You are waging war against things that are not there, against threats that’ve never existed. Russia has borders that are respected and will be respected, no western government is plotting to cross them nor sabotage or dissolve your country. That border shall stay undisturbed forever. It’s not USA, NATO nor European union. Your own government has tricked you. You don’t even know why you are there. Barely 20 year old kids are suffering and dying in foreign country for absolutely nothing. There is no gain from this war.\n\nYour neighbours are independent and sovereign with clearly defined borders and they only want to decide about their own future themselves. In any circumstances they want to do you harm or take what’s yours. They just want to be free without being tool of insane egoistic president of another country who dreams about restoring empire long gone. Empire that held nations against their will. It’s time to let them go. You can’t make friends by force. Ever. Your people won’t have better lives, you will just make other people suffer. This only makes whole world hate you and you won’t be treated the same ever again after this. Every single citizen of your country will experience tough treatment and prejudices over the world meanwhile your president won’t care as he doesn’t care now. You can do better. You are capable of great things in science, arts, sports and many more fields, but not with government leading you to hell. You still got this in your own hands. Just go home and make history by creation of great things that your country can benefit from, not by threatening, crushing and oppresing others. You did this to my country too and it cost us a lot. Czechoslovakia 1968. Nikagda nezabudim.\n\nI will leave this to live it’s own life. I won’t respond comments and messages. Hopefuly it can reach at last someone.  \n\n\\- Random guy from the internet\n\nAmmend: I’ve posted this into threads and comments few times before, but there is one more thing to say. Donetsk and Luhansk are very complicated matter, but if there were any Ukraine wrongdoings on Russian people or even genocide going on (according to Russian leaders), we do have international institutions and ogranizations to prevent that. First step would be to collect all possible evidence and demand United Nations to dispatch blue helmets (and that’s only one of many possibilities). Russian leaders has never intended to do so, instead they’ve fabulated and mystified and used this as spark for a war to gain complete political control of milions and milions of people and territory. It happened before, remember Franz Ferdinand D’Este or Gleiwitz. It’s just a very weak excuse for commiting war crimes on civilians, schools and hospitals. This is not helping those in need, this is sacrificing them for higher goals. Russian president has never cared and never will. He is hidding behind backs of soldiers and even dragging other nations (Chechnya, Belarus, he even tried Kazakhstan) into fighting for his pleasure.\n\nAlso I do agree that western world is far from ideal, but armies of NATO are there to protect its members, not to attack across someone elses borders. It was not NATO trying to recruite Ukraine into its ranks, Ukraine hoped for membership in desperate need of guarantee of staying in peace with all its neighbours, Russia including. It’s not important if solution is being neutral or EU or NATO, whatever it takes, let borders of all involved countries stay undisturbed and let nations decide their own future.   \n \n\nPS: Anyone who wants to copypaste this, feel free to do so.\n\n\\*\\*\\*\n\nЭто обращение ко всем русским, участвующим в боях на Украине, к фронтовикам, к русским дома, чьи сыновья, мужья и друзья гибнут на Украине, ко всем, кто мало что может сделать, чтобы остановить это. Это полное безумие. Вы ведете войну против вещей, которых нет, против угроз, которых никогда не существовало. У России есть границы, которые уважаются и будут соблюдаться, ни одно западное правительство не замышляет их пересечь, не саботирует и не распускает вашу страну. Эта граница останется нетронутой навсегда. Это не США, НАТО или Европейский союз. Ваше собственное правительство обмануло вас. Ты даже не знаешь, зачем ты здесь. Едва ли 20-летние дети страдают и умирают в чужой стране абсолютно ни за что. Нет никакой выгоды от этой войны.\n\nВаши соседи независимы и суверенны с четко очерченными границами и хотят сами решать только свое будущее. При любых обстоятельствах они хотят причинить вам вред или забрать то, что принадлежит вам. Они просто хотят быть свободными, не будучи орудием безумного эгоистичного президента другой страны, мечтающего восстановить давно ушедшую империю. Империя, державшая народы против их воли. Пора их отпустить. Насильно дружить нельзя. Всегда. У ваших людей не будет лучшей жизни, вы просто заставите других людей страдать. Это только заставляет весь мир ненавидеть вас, и после этого к вам больше не будут относиться так же. Каждый гражданин вашей страны будет сталкиваться с жестким обращением и предрассудками в мире, а вашему президенту будет все равно, как ему сейчас все равно. Ты можешь лучше. Вы способны на великие дела в науке, искусстве, спорте и во многих других областях, но не с правительством, ведущим вас в ад. Вы все еще держите это в своих руках. Просто идите домой и творите историю, создавая великие дела, от которых ваша страна может извлечь выгоду, а не угрожая, сокрушая и угнетая других. Вы сделали это и с моей страной, и это дорого нам обошлось. Чехословакия 1968. Никогда незабудим.\n\nЯ оставлю это, чтобы жить своей собственной жизнью. На комментарии и сообщения не отвечаю. Надеюсь, это наконец до кого-то дойдет.\n\n\\- Случайный парень из интернета\n\n(Это не было частью оригинального текста, поэтому я перевел с помощью Google, извините за возможные ошибки.)\n\nПоправка: я уже несколько раз публиковал это в темах и комментариях, но есть еще одна вещь, которую нужно сказать. Донецк и Луганск - очень сложный вопрос, но если Украина совершала какие-либо правонарушения в отношении русского народа или даже происходил геноцид (по словам российского руководства), у нас есть международные институты и организации, чтобы предотвратить это. Первым шагом было бы собрать все возможные доказательства и потребовать от Организации Объединенных Наций отправить «голубые каски» (и это только одна из многих возможностей). Российские лидеры никогда не собирались этого делать, вместо этого они выдумали и мистифицируют и использовали это как искру для войны, чтобы получить полный политический контроль над миллионами и миллионами людей и территорий. Это случалось и раньше, вспомните Франца Фердинанда Д’Эсте или Гляйвица. Это просто очень слабое оправдание для совершения военных преступлений против мирных жителей, школ и больниц. Это не помощь нуждающимся, это жертвование ими ради более высоких целей. Российского президента это никогда не заботило и никогда не будет. Он прячется за спинами солдат и даже втягивает другие народы (Чечню, Белоруссию, даже Казахстан пробовал) воевать для своего удовольствия.\n\nТакже я согласен с тем, что западный мир далек от идеала, но армии НАТО существуют для защиты своих членов, а не для нападения через чужие границы. Не НАТО пыталась завербовать Украину в свои ряды, Украина надеялась на членство, отчаянно нуждаясь в гарантиях сохранения мира со всеми соседями, в том числе и с Россией. Неважно, будет ли решение нейтральным, или ЕС, или НАТО, что бы это ни стоило, пусть границы всех вовлеченных стран остаются нетронутыми, и пусть нации сами решают свое будущее.\n\nP.S. Кто хочет скопировать это, не стесняйтесь.","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ukraine/comments/t2ndhx/to_sane_russians/","comments":[]}]},{"timestamp":1645977636192,"author":"reddit:ukraine/pat_labor_ingram","title":"A Chinese living in Scandinavia stand for Unkraine","content":"It's not much, about 100 euro. I disapprove CCP's attitude regarding Russia's invasion. I support Ukraine. Your president Zelenskyy is amazing. \n\nPlease be aware of not all Chinese support CCP/Russia. We are just being kidnapped.\n\nhttps://preview.redd.it/rniaz5szcek81.png?width=1436&amp;format=png&amp;auto=webp&amp;s=a00b899a840b6874d1269440adb3f6ad0f96cb31","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ukraine/comments/t2r3zm/a_chinese_living_in_scandinavia_stand_for_unkraine/","comments":[]}]},{"timestamp":1645977636192,"author":"reddit:ukraine/forgiven41","title":"Is it possible for Ukrainians to take out compressor and pump stations to stop Russia's ability to use the pipelines to sell oil and gas?","content":"Given Russia's dependence on selling energy and the pipelines through Ukraine and the slow response of the world to cut Russia off, could Ukrainians take pit the pump and compressor stations? Even if they end up occupying Ukraine, the Russians would have a hell of a time fixing that before they are financially bled dry.","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ukraine/comments/t2r4uq/is_it_possible_for_ukrainians_to_take_out/","comments":[]}]},{"timestamp":1645977636241,"author":"reddit:CombatFootage/charleselliott33","title":"Has Ukraine attacked any military assets in Russia?","content":"Any reported missile launchers destroyed or air assets taken down in Russian territory yet?","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/CombatFootage/comments/t2jpsy/has_ukraine_attacked_any_military_assets_in_russia/","comments":[]}]},{"timestamp":1645977636241,"author":"reddit:CombatFootage/Ratagon","title":"Radio Liberty: An-225 Mriya, one of the largest aircraft in the world, was burned at the Gostomel airport near Kiev","content":"According to two sources of Radio Liberty * in the state enterprise \"Antonov\", \"Mriya\" was destroyed as a result of an air attack by Russian troops.  Sources provided the publication with a photograph of the destroyed hangar in which the Mriya was located.\n\n The information of Radio Liberty was also confirmed by the mayor of the city of Bucha.","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/CombatFootage/comments/t2pd3s/radio_liberty_an225_mriya_one_of_the_largest/","comments":[]}]},{"timestamp":1645977636241,"author":"reddit:CombatFootage/bitparity","title":"Question (footage related). Why aren't we seeing Russian drone strikes in Ukraine? Have they been neutralized somehow?","content":"I've seen videos of Ukrainian drone strikes on Russian troops, but none of Russian drones on Ukrainian troops, and you KNOW if the Russians had such footage, they'd be broadcasting it all over Russian media.\n\nWe know the Russians have them, we know they've used them in the past, so what's keeping them from being used in Ukraine, or have they somehow been neutralized somehow?","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/CombatFootage/comments/t2r7mc/question_footage_related_why_arent_we_seeing/","comments":[]}]},{"timestamp":1645977636256,"author":"reddit:UkraineWarReports/noctesomniatis","title":"IMPORTANT LINKS FOR UKRAINIAN REFUGEES","content":"1. Facebook group with living and transport help for refugees https://m.facebook.com/groups/683793819641997/?ref=share\n\n2. Fb group with places that refugees can stay in, sleep in, apartaments and houses https://m.facebook.com/groups/298697502176538?group_view_referrer=search\n\n3.fb group about transport from Ukraine to Poland https://m.facebook.com/groups/665520791308207/?ref=share\n\n4. Resources for Ukrainian refugees https://docs.google.com/document/u/0/d/1OlZIz-72A2xI2uUOFE07L5ObQGP4JDcXZ2vdIs2P9BQ/mobilebasic?fbclid=IwAR1iyCkraJMRcHekVXIYJRoMx3ftigqR7d14n-yshr7q3mi438Cxr_sjSdg\n\n5. Free train tickets for Ukrainian refugees from a polish company pkp intercity https://www.intercity.pl/pl/site/o-nas/dzial-prasowy/aktualnosci/bezplatne-przejazdy-dla-obywateli-ukrainy-pociagami-pkp-intercity.html?fbclid=IwAR2YvmFgW60UoO7gf17lSvt7iJ2_EKBQ7thJYr7jfYtLprFZdpLSLEp3C-c\n\nIf you need psychological help call +48 669 981 038 ( they speak ukrainian and russian ) \n\nAnd for others:\n\nLists of protests all around the world - stand with Ukraine https://standwithukraine.live/peace-protests/?utm_source=ActiveCampaign&amp;utm_medium=email&amp;utm_content=Fluchtwege+offenhalten%3A+PRO+ASYL+zum+Krieg+gegen+die+Ukraine&amp;utm_campaign=Fluchtwege+offenhalten%3A+PRO+ASYL+zum+Krieg+gegen+die+Ukraine%21\n\n\nFor more info go to my instagram profile :zofiaalaya I’ll try to get some help any way I can! \nOr follow these profiles (they share info on their stories) : \n\nhttps://instagram.com/misia_furtak?utm_medium=copy_link\n\nhttps://instagram.com/maniakedra?utm_medium=copy_link\n\nhttps://instagram.com/tumarianina?utm_medium=copy_link\n\n\nIf you know anybody from Ukraine that needs help please let me know or share this post so they can see it!","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/UkraineWarReports/comments/t2d5bl/important_links_for_ukrainian_refugees/","comments":[]}]},{"timestamp":1645977636256,"author":"reddit:UkraineWarReports/Any_Seaworthiness990","title":"How do I get there?","content":"If I wanted to join Ukrainian forces and get there as soon as possible, how would I go about it? I have no passport and the soonest I could get one through expediting is 5 weeks and don't really want to sit for that long. So if there's any legal recommendations, I'm all ears.","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/UkraineWarReports/comments/t2h28t/how_do_i_get_there/","comments":[]}]},{"timestamp":1645977636256,"author":"reddit:UkraineWarReports/uwya17hhay","title":"Is Odesa internet out?","content":"My fiancé stopped responding to me on text and call and I am extremely scared does anyone know if the internet is out there or any updates on the situation there? Please help I am desperate","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/UkraineWarReports/comments/t2h7ex/is_odesa_internet_out/","comments":[]}]},{"timestamp":1645977636256,"author":"reddit:UkraineWarReports/LyingLieGroup","title":"[Unconfirmed]","content":"Ukrainian soldiers from French Foreign Legion will be able to join in with full combat equipment.\n\nhttps://twitter.com/nexta_tv/status/1497841138811785218?cxt=HHwWhMC-jY6ls8kpAAAA","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/UkraineWarReports/comments/t2jvel/unconfirmed/","comments":[]}]},{"timestamp":1645977636256,"author":"reddit:UkraineWarReports/LyingLieGroup","title":"Ukrainian drone vs Russian military equipment","content":" https://twitter.com/nexta\\_tv/status/1497861155565539331?s=20&amp;t=Atix2Ltzg3Tlx5Y6aMngiQ ","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/UkraineWarReports/comments/t2kgma/ukrainian_drone_vs_russian_military_equipment/","comments":[]}]},{"timestamp":1645977636256,"author":"reddit:UkraineWarReports/LyingLieGroup","title":"New PoW. Kindergartens in Russia must be empty right now, I presume","content":"https://twitter.com/nexta_tv/status/1497870833842376704?s=20&amp;t=1_qV3WyOMzLamFUXQJpPQQ","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/UkraineWarReports/comments/t2kxfx/new_pow_kindergartens_in_russia_must_be_empty/","comments":[]}]},{"timestamp":1645977636256,"author":"reddit:UkraineWarReports/LyingLieGroup","title":"Losses of Russian Military according to UA","content":"4300 soldiers dead or wounded\n\n146 tanks destroyed\n\n706 apcs\n\n27 aircraft\n\n26 helicoptes and more:\n\nhttps://en.interfax.com.ua/news/general/803169.html","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/UkraineWarReports/comments/t2lrls/losses_of_russian_military_according_to_ua/","comments":[]}]},{"timestamp":1645977636256,"author":"reddit:UkraineWarReports/Vaclavzaycev","title":"We are in shelter","content":"On February 24, at 5 am, we woke up from loud explosions and shots, in fact, I didn’t understand then, I thought it was fireworks or anything but not a cannonade.\n\n That night I was able to fall asleep only by 4 in the morning, and an hour later it began.  My wife stood at the window and trembled with fear, for some time I tried to come to my senses and wake up in order to think sensibly.  At 5:15 am we started gathering the essentials:\n Power banks, phones, chargers, food, money, documents for yourself and your children.\n\n The pick up took about an hour.  Around 6:30 we were at the bomb shelter, but it was closed.  We are 6 people, two children, my wife and I and my wife's parents.\n\n I decided to fill up the car with gas, I usually drive on propane and don't use much gas, but I still need it to start the car and switch to propane.\n\n We stood for about an hour all together at the gas station, but the line did not move.  I decided to return to the shelter, the news reported that they were opening.\n\n All morning we were engaged in arranging a shelter, carrying benches, chairs, seats, building places for shelter.\n\n At 11 o'clock there were not many of us, about 50 people.  By evening we were over 200 people.\n\n People are praying.  Fear.  They panic.\n\n I try to talk and reassure many people, this is not the first time we are fleeing from the war ... but last time we fled with our future wife, and now with our children, it’s scary not for ourselves.  Scary for the kids.\n\n\n Thus ended the first day of the war.","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/UkraineWarReports/comments/t2m08g/we_are_in_shelter/","comments":[]}]},{"timestamp":1645977636256,"author":"reddit:UkraineWarReports/Revolutionary_Can927","title":"please share this post with everyone!!! #ukraine","content":"    The MOI is asking to share the below info:  opposition journalists from Belarus (reliable source) say that units of the Belarusian special operations forces are boarding planes. An airborne landing is being prepared. Thus, Belarus actually began invading Ukraine with personnel. Landing locations: Kyiv and Zhytomyr directions. It should be disseminated to foreign media as soon as possible, if possible.","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/UkraineWarReports/comments/t2o9j5/please_share_this_post_with_everyone_ukraine/","comments":[]}]},{"timestamp":1645977636256,"author":"reddit:UkraineWarReports/LyingLieGroup","title":"Буча","content":" https://twitter.com/666\\_mancer/status/1497914392209330176?s=20&amp;t=lIU5EJ8Ykb\\_2LhpQ3PFopQ","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/UkraineWarReports/comments/t2pknx/буча/","comments":[]}]},{"timestamp":1645977636256,"author":"reddit:UkraineWarReports/betterbuilder7","title":"Will Putin start a nuclear war?","content":"\n\nhttps://www.reddit.com/poll/t2q20j","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/UkraineWarReports/comments/t2q20j/will_putin_start_a_nuclear_war/","comments":[]}]},{"timestamp":1645977636579,"author":"reddit:russia/Bagration44","title":"How long before Zelensky flee Kiev 🤡","content":"\n\nhttps://www.reddit.com/poll/t0rji6","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/russia/comments/t0rji6/how_long_before_zelensky_flee_kiev/","comments":[]}]},{"timestamp":1645977636579,"author":"reddit:russia/Bagration44","title":"It's looks like Federal Ukraine is going to be a thing soon, what will be the name?","content":" \n\n\nhttps://www.reddit.com/poll/t0vc3w\n\n\nMaybe  first order of business will be to repeal this odious discriminatory bill against the Russian language :/","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/russia/comments/t0vc3w/its_looks_like_federal_ukraine_is_going_to_be_a/","comments":[]}]},{"timestamp":1645977636579,"author":"reddit:russia/Bagration44","title":"Do you support this military operation","content":"Don't answer if you don't \n\nhttps://www.reddit.com/poll/t13jl1","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/russia/comments/t13jl1/do_you_support_this_military_operation/","comments":[]}]},{"timestamp":1645977636579,"author":"reddit:russia/Bagration44","title":"When it's over , a kind of Nuremberg trial should be held , I want every high ranking Ukrainians military officers in a court in Moscow.","content":"We want answer on the burning at Odessa,   war crimes in Donbass and this minory rights bills they voted last year.\n\nAzov bataillon members need to be transfer to the Russian Judicial system.\n\nModern day Ukrainian Judicial system is infective and corrupt so maybe temporary,  they will use  judges from Russia to replace them.","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/russia/comments/t14d8k/when_its_over_a_kind_of_nuremberg_trial_should_be/","comments":[]}]},{"timestamp":1645977636579,"author":"reddit:russia/Bagration44","title":"Has Russia commit war crimes in Ukraine?","content":"\n\nhttps://www.reddit.com/poll/t19829","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/russia/comments/t19829/has_russia_commit_war_crimes_in_ukraine/","comments":[]}]},{"timestamp":1645977636579,"author":"reddit:russia/angry-russian-man","title":"Do you know what makes Russia unique?","content":"Just 20 years ago, many of their people were against Russia. Today they are ready to fight for Russia. Believe me, it will be the same with Ukrainians.\n\nhttps://preview.redd.it/oa0sq3bso0k81.png?width=1280&amp;format=png&amp;auto=webp&amp;s=ae9adfab405d840a68366b7ea0364b690cab556c","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/russia/comments/t1a0gq/do_you_know_what_makes_russia_unique/","comments":[]}]},{"timestamp":1645977636579,"author":"reddit:russia/angry-russian-man","title":"My appeal to civilians in Ukraine","content":"People, please, I don't want civilians to die in Ukraine. So read and spread these simple rules: \n\n1. Don't walk the streets in a war zone. You risk becoming a victim of accidental shelling.\n\n2. Do not film the fighting while standing at the window. In the case of close explosions, you may be injured or even killed by an accidental shard or shards of glass knocked out by the shock wave.\n\n3. Do not try to interfere with moving vehicles or people with weapons. Even if you are very confident in yourself. Even if you think you can handle it easily.\n\n4. Do not try to fire at the military, even if you have received a weapon. In fact, if you are a civilian, you have no right to participate in hostilities. If you can't wait to fight - first get a legal status - join the army. But just don't attack the military, no matter which side they belong to.\n\n5. Do not risk your life in order to make a fascinating report. There are a lot of videos on the web right now where people literally climb into the very line of fire in order to shoot an exciting video. Your life is one, it's not computer games. Don't risk it unnecessarily.\n\n6. If you observe that the military, their armored vehicles or any equipment of any of the parties to the conflict are located next to you - go as far away as possible and as soon as possible, or find a safe haven. There is a high probability that this place will become a target for artillery fire or a bomb attack.\n\n7. Categorically avoid any places of mass gatherings of people. Avoid people with guns even more. Stay away from them and try not to show them in their eyes in any case. Remember that the effective radius of aiming small arms fire is 400-800 meters. Now a lot of weapons in Kiev have been distributed to random people. Anyone could be among them. It can be bandits, drug addicts, looters. So avoid meeting such people.\n\nPlease stay safe, we have to survive the current events. All together. Take care of yourself and your loved ones.","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/russia/comments/t1b2s8/my_appeal_to_civilians_in_ukraine/","comments":[]}]},{"timestamp":1645977636579,"author":"reddit:russia/Bagration44","title":"Ukrainians if you are injured and need medical assistance and hospital near you are unavailable, raise your hands at all time and walk slowly towards Russian line, communicate and shout \"injury\"","content":"Do not do that in a combat situation or firefight.\n\nRussian medical unit will take care of you in their capacity and help you.","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/russia/comments/t1bvhx/ukrainians_if_you_are_injured_and_need_medical/","comments":[]}]},{"timestamp":1645977636579,"author":"reddit:russia/Bagration44","title":"Kiev and Kharkiv( two of Ukraine largest cities) will be siege in the coming days. The Russian army will uphold , IHL treaty law.","content":"*Article 54 AP I and Article 54(2) will be upheld.*\n\nThere will be no deprivation of food and water and also of other goods essential to survival in a particular context, for example heating oil and blankets, medicines and medical equipment.","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/russia/comments/t1f6i2/kiev_and_kharkiv_two_of_ukraine_largest_cities/","comments":[]}]},{"timestamp":1645977636579,"author":"reddit:russia/[deleted]","title":"It seems the majority of insults that come at us here, are about Putin's cock. And I wonder, why they're so concerned about his cock?","content":"\n\nhttps://www.reddit.com/poll/t1hduj","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/russia/comments/t1hduj/it_seems_the_majority_of_insults_that_come_at_us/","comments":[]}]},{"timestamp":1645977636579,"author":"reddit:russia/Bagration44","title":"Eldery person car crushed by Russia tank is fake it was a Ukrainian tank Strela-10","content":"Proof:\n\nhttps://twitter.com/ejmalrai/status/1497231536437055499 and sticky below in the comments.\n\n\n\n&gt;Russians citizens and members of the diaspora avoid Reddit info, do not engage.\n\n&gt;Disinformation and Russophobia is rampant( it's part of the war) . For the time being.\n\n&gt;The mods of /r/Russia will keep you updated as much we can.\n\n{But honestly just stay away from the platform go to VK for info and Telegram Channel( we will try to do a list of them for you).\n\n&gt;Our team will forward instructions and sticky on /r/Russia for your family and friends in Ukraine.\n\nAlso\n\nhttps://www.reddit.com/r/russia/comments/t1gf8u/ukrainian_soldier_poses_as_a_russian_pow_so_take","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/russia/comments/t1j1m8/eldery_person_car_crushed_by_russia_tank_is_fake/","comments":[]}]},{"timestamp":1645977636579,"author":"reddit:russia/Bagration44","title":"Thanks to Western Kindness , Russia will soon seize brand new stocks of Manpads, stingers and other good NATO stuff , what should Russia do with them?","content":"\n\nAt the rate Ukrainian militarily is leaving stuff behind and retreating ( ANA need to not feel alone and ashamed anymore!).  Something need to be done!\n\nhttps://www.reddit.com/poll/t1wqp2","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/russia/comments/t1wqp2/thanks_to_western_kindness_russia_will_soon_seize/","comments":[]}]},{"timestamp":1645977636579,"author":"reddit:russia/angry-russian-man","title":"MEMO To the civilian population of the occupied territories","content":"Brothers and sisters! Residents of Ukraine!\n\nThe Russian army came to destroy the henchmen of the capitalist regime, to destroy the fascist reptile that raised its head on earth, for which our grandfathers shed blood. The Russian soldier is fighting the Fascist again, and not with ordinary residents. Our enemy is those who plundered the country and destroyed the population in favor of the West.\n\nOrdinary residents of Ukraine are not our enemies, but our brothers!\n\nREMEMBER:\n\nA Russian soldier NEVER fights with civilians.\n\nA Russian soldier NEVER covers himself with civilians.\n\nA Russian soldier will ALWAYS protect and help.\n\nOUR CAUSE IS RIGHT, THE ENEMY WILL BE DEFEATED, UKRAINE WILL BE FREE!\n\nRULES OF CONDUCT:\n\n1. If you see people with weapons, military equipment - stay away from them. If you need to get close to them, wave your arms, attract attention to yourself and follow the orders of the military. This will ensure your safety.\n\n2. Do not approach armored vehicles: you may simply not be noticed from the inside.\n\n3. If you have a weapon, keep it at home, do not take it outside. Otherwise, you may be mistaken for a saboteur, robber or marauder. Use weapons only to protect the life and health of yourself and your loved ones, if there is no other way out.\n\n4. Form mutual aid units. Chat with your neighbors.\n\nGo outside only in groups and only if necessary.\n\n5. Do not move around unknown areas.\n\n6. Drive the car carefully, at a speed of 40-50 km / h. Don't move anywhere unless absolutely necessary. Turn on the interior light at night so that you can be seen.\n\n7. Make sure that the children do not go outside and are always with you.\n\n8. Know where the nearest sources of drinking water and food are,\n\nmedicines (shops, pharmacies, water supply). If you are constantly taking\n\nmedications, keep them in stock for a week.\n\n9. If possible, call your family, friends and acquaintances,\n\ntell them about the situation around you. This will show you that you are alive.\n\nIF YOU HEAR SHOOTING AND EXPLOSIONS, you need to go to a room without windows: a basement,\n\na bathroom or toilet, a stairwell and wait until the shooting and shots are\n\nover. Then wait another 15 minutes. Only then can you look out the window.\n\nIF MILITARY EQUIPMENT IS LOCATED AND FIRING NEAR YOUR HOUSE –\n\nLEAVE YOUR HOUSE IMMEDIATELY AND MOVE AWAY!\n\nIF YOU NEED WATER, FOOD OR MEDICAL HELP –\n\nPLEASE CONTACT THE RUSSIAN SOLDIERS. THEY WILL HELP YOU FOR FREE.\n\n&amp;#x200B;\n\nSupplement from the OP: Dear citizens of Ukraine. Currently, I see that the Ukrainian authorities are doing everything to maximize the number of civilian casualties: \n\n1. They are blowing up bridges, which will cause a logistical collapse and lead to a humanitarian catastrophe. \n2. They distribute weapons absolutely uncontrollably, which has already led to casualties among the population and a sharp increase in crime. \n3. They have heavy armored vehicles and artillery in residential areas, provoking retaliatory strikes - this will undoubtedly lead to a large number of civilian casualties. \n4. Ukrainian resources are now busy spreading a huge number of fakes. \n5. Finally, the main thing: the Ukrainian authorities in every possible way evades negotiations and forbids the military to lay down arms in the conditions of a hopelessly lost military campaign.\n\nPlease stay safe and don't take unnecessary risks now. Know that we are all praying for you to stay alive.","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/russia/comments/t1ya3b/memo_to_the_civilian_population_of_the_occupied/","comments":[]}]},{"timestamp":1645977636579,"author":"reddit:russia/Jovin2000","title":"A hope for better times","content":"I am writing  this  text in the  hope  of better times.\nRight now while the war is raging and Nato and Russia are exchanging threats and both sides are trying  to  spread their view. Independent  from the outcome of  the war our continent  changed.\n\n I want to write about  the hope that  we will  find back together  as Europeans and are able to speak  about  security  concerns as Europeans. I hope  we will rebuild  trade and cultural relations  as Europeans  and not  as Russia and Nato, this is our common \"House of Europe\". I really  like  your  culture  and your food, I  know some Russian families here, they are really good people.  \nMy prayers are going also to your soliders, that they  will  be return home  safe. \nSo I am hoping  and praying  for  the  best  and  hope that Germans and Russians will  find back together and solve our Problems  as Europeans and built together  a peaceful  Europe for all countries, where our nations prosper and our relations regarding economics and culture will be deep and  long.\nMay God bless  you  all and  let's pray  and hope for a better  future.\n\nSincerely from  a friend in Germany","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/russia/comments/t215gi/a_hope_for_better_times/","comments":[]}]},{"timestamp":1645977636579,"author":"reddit:russia/Eckleel","title":"Do you think Russia is justified with its concerns about NATO imperialism in Europe and the rest of the world especially after NATO's war crimes across the world and ditching the responsibility of solving the immigration crisis created by them ?","content":"\n\nhttps://www.reddit.com/poll/t2396p","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/russia/comments/t2396p/do_you_think_russia_is_justified_with_its/","comments":[]}]},{"timestamp":1645977636579,"author":"reddit:russia/Bagration44","title":"Dear citizens of Ukraine and Ukrainians abroad and on Reddit","content":"As the sieges begin and forces are trying to help.\n\nCurrently, I see that some bad actors in the Ukrainian authorities(not all) are doing everything to maximize the number of civilian casualties:\n\n 1. They are blowing up bridges, roads and railways which will cause a logistical collapse and lead to a humanitarian catastrophe. \n\n 2. They distribute weapons absolutely uncontrollably, which has already led to casualties among the population and a sharp increase in crime. \n\n 3. They have heavy armored vehicles and artillery in residential areas, provoking retaliatory strikes - this will undoubtedly lead to a large number of civilian casualties. \n\n 4. Ukrainian resources are now busy spreading a huge number of fakes/propaganda pics for western politicians and social media influencers. \n\n 5. Finally, the main thing: the Ukrainian authorities in every possible way evades negotiations and forbids the military to lay down arms in the conditions of a hopelessly lost military campaign.\n\nPlease stay safe and don't take unnecessary risks now. Know that we are all praying for you to stay alive.\n\nGlory to Ukraine and Russia , glory for the safety of our families!","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/russia/comments/t26nky/dear_citizens_of_ukraine_and_ukrainians_abroad/","comments":[]}]},{"timestamp":1645977636579,"author":"reddit:russia/angry-russian-man","title":"Has no one noticed yet?","content":"After all, Vladimir Putin literally ended the world coronavirus pandemic with his speech!","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/russia/comments/t27hwp/has_no_one_noticed_yet/","comments":[]}]},{"timestamp":1645977636579,"author":"reddit:russia/angry-russian-man","title":"❗️ Actions of the population in case of emergency at chemical hazardous facilities ❗️","content":"1. Avoid prolonged exposure to the air in the early morning and in the hot time of the day. Children and pregnant women should refrain from long walks.\n\n2. Limit window openings, especially at night and early in the morning. When opening, cover them with a damp cloth and periodically change it.\n\n3. Use air conditioning systems at home and at work (without air intake from the street into the room) and air purification.\n\n4. Carry out wet cleaning in residential premises and workplaces; it is also useful to put containers with water in residential and working premises to increase air humidity.\n\n5. When the smell of smoke increases, it is recommended to wear protective masks, which should be moistened, and window and door openings should be insulated with a damp cloth.\n\n6. Increase fluid intake to 2-3 liters per day for adults. To compensate for the loss of salts and trace elements, it is recommended to drink salted and mineral alkaline water, lactic acid drinks (skim milk, whey), juices, mineral drinks, oxygen-protein cocktails. Exclude carbonated drinks.\n\n7. Take a shower several times a day, rinse your nose and throat.\n\n8. For people suffering from cardiovascular diseases, it is suggested to measure blood pressure at least 2 times a day, with stable hypertension and any other symptoms of malaise, consult a doctor.\n\n9. In case of very strong atmospheric air smoke, it is recommended, if possible, to leave the locality that has been exposed to smoke or limit the time spent in it.\n\n10. One of the most dangerous substances is ammonia. Signs of poisoning: copious lacrimation, pain in the eyes, burn and conjunctivitis of the cornea, loss of vision, paroxysmal cough, with skin damage — chemical burn of 1 or 2 degrees.\n\nImmediate medical attention is strongly recommended.","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/russia/comments/t2c8vg/actions_of_the_population_in_case_of_emergency_at/","comments":[]}]},{"timestamp":1645977636579,"author":"reddit:russia/Bagration44","title":"How do you think some Redditors will react after that fog of war is lifted early this week and Russian flag fly on the Rada?","content":"The fakes I am seeing make me glad I speak Russian and I am on Telegram and VK.\n\n\n\nhttps://www.reddit.com/poll/t2dtfh\n\nAgain Russians, Russians abroad and sympathizers avoid Reddit  for any  info  on this peacekeeping operation, keep your moral high.\n\nOur national sub is besieged and our team isn't giving an inch of it.\n\nI pray for Ukrainians, Russians and their families and peace🙏🏻","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/russia/comments/t2dtfh/how_do_you_think_some_redditors_will_react_after/","comments":[]}]},{"timestamp":1645977636579,"author":"reddit:russia/angry-russian-man","title":"A call to the mind of Ukrainians","content":"Hello, people. \n\nRecently I have been seeing a lot of videos with captured Russian soldiers sent from Ukraine. Many \"russian soldiers\" are actors from the Ukrainian army, or even random Russian civilians living in Ukraine, most of these videos are fake, of course. \n\nBut there really are a couple of videos with real Russian soldiers. And they all have one thing in common: the brutal aggression on the part of the Ukrainians towards the prisoners. They are beaten, humiliated and insulted.\n\nI understand that it is useless to point out to you such things as humanity, or the rules for the treatment of prisoners of war, fixed in the Geneva Convention on the Treatment of Prisoners of War. \n\nI'm just asking you to realize that your cruel treatment of unarmed prisoners does not go unnoticed. In addition to the obvious media damage to your image of \"defenders of the country\" (it is quite difficult to sympathize with a pack of aggressive baboons beating an unarmed or wounded person), you endanger your own soldiers.\n\n How soon do you think your prisoners will receive the same treatment?\n\nOrdinary people are fighting on both sides. And inciting hatred is definitely not the way that leads to the end of the conflict.","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/russia/comments/t2mf7k/a_call_to_the_mind_of_ukrainians/","comments":[]}]},{"timestamp":1645977636679,"author":"reddit:RussiaUkraineWar2022/Resolve-Guilty","title":"Will other countries be attacked by Russia? What do you think will happen next?","content":"I’m genuinely curious to hear everyone’s thoughts, do you think this will come to an end in a few days or this could completely turn into something like WW3?","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/RussiaUkraineWar2022/comments/t2hf6t/will_other_countries_be_attacked_by_russia_what/","comments":[]}]},{"timestamp":1645977636679,"author":"reddit:RussiaUkraineWar2022/epistormreader","title":"I am a Russian living in the US, and I'm getting different information from both sides. How is this \"information soup\" for real in 2022?","content":"I know both Russians and Ukrainians. I myself don't know much about politics so I try to stay out of it. \n\nA lot of my family from Russia and Ukraine are saying that Putin is good. Basically, the Russian news media counteracts any \"bad Russian acts\". Like, the tank that ran over the car and was firing gunshots - that was apparently a Ukranian tank according to Russian media. \n\nThe building that got bombed? It got bombed by Ukranians trying to counteract the Russian bomb, but Russians only wanted to bomb the weapons stations, not the residential building. \n\nI am getting so much information soup right now, I don't understand how to make sense of this. Why do these two sides say completely different things? How do they manage to do that? \n\nIt's like if you show the same movie but narrate it differently, add different effects and music... it's like seeing two different movies except they're the same. You could literally turn a depressing movie into a happy one and visa versa and it would still be the same movie... Wtf how do I make sense of all this?","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/RussiaUkraineWar2022/comments/t2hxz4/i_am_a_russian_living_in_the_us_and_im_getting/","comments":[]}]},{"timestamp":1645977636679,"author":"reddit:RussiaUkraineWar2022/Aydeos","title":"Kharkiv Live Cam Feed","content":"Are there any live kharkiv cam feed for students and people stuck in bunkers.","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/RussiaUkraineWar2022/comments/t2iwq3/kharkiv_live_cam_feed/","comments":[]}]},{"timestamp":1645977636679,"author":"reddit:RussiaUkraineWar2022/KSHITIJ__KUMAR","title":"Will Puttin end invasion soon?","content":"It is hailed as third largest and strongest army in the world and it is done embarrassingly very pathetic job of invasion. News from Ukraine tells of downing 20+ jets, and two heavy transporters!, and 100+ tanks. Moreover morale of Ukrainian is very high. Should we see Russia back to negotiations in coming days Or world War 3 is still impending on us?","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/RussiaUkraineWar2022/comments/t2j06i/will_puttin_end_invasion_soon/","comments":[]}]},{"timestamp":1645977636679,"author":"reddit:RussiaUkraineWar2022/Apprehensive-Seat938","title":"Adolf Hitler famous quotes about Modern War","content":"The happy days of mankind have passed.\nSuccess is the sole mortal judge of right and wrong.\nWhen you win, you don't need to explain. If you lose, you shouldn't be here to explain.\n\nI only fight for what I love, only love what I respect, and only respect what I know.\nWhat can those who light the torches of war in Europe want but chaos?\nThink 1000 times before deciding. Once decided, never go back even with 1000 difficulties.","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/RussiaUkraineWar2022/comments/t2ltyz/adolf_hitler_famous_quotes_about_modern_war/","comments":[]}]},{"timestamp":1645977636679,"author":"reddit:RussiaUkraineWar2022/JanJaapen","title":"Question","content":"I’m seeing conspiracy channels state that there are places in Ukraine which had been cut off from water and other basic necessities before the Russians showed up. Supposedly the first thing they Russians did was to restore these needs to the locals. \n\nI have also read something about a serious Neo-nazi problem in Ukraine. I saw someone post some picture of a Ukrainian soldier with a flag which was basically a Ukrainian flag combined with some sort of a swastika. \n\nI am looking into what the basis for these kinds of posts can be. Is there any truth behind it? It seems so far fetched that I’m inclined to throwing in the trash. I’m just trying to educate myself on the how and why of the big picture before calling something bullshit. \n\nIf anyone knows anything about this, or has arguments why this is or isn’t bullshit, I’d love to know. Thank you in advance.","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/RussiaUkraineWar2022/comments/t2m624/question/","comments":[]}]},{"timestamp":1645977636679,"author":"reddit:RussiaUkraineWar2022/chdavidd","title":"🇺🇦 Let’s stand with Ukraine! Ways to help the people of UA.","content":"I made this website with interactive lists of resources to help the people of Ukraine during these tough times:\n\n1. Donating\n2. Helping without money (free)\n3. Country-specific resources\n\nCome up with your own resource and it will be added to the list instantly. Let's #StandWithUkraine!\n\nWebsite: **helpukraine.simple.ink**","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/RussiaUkraineWar2022/comments/t2mbs1/lets_stand_with_ukraine_ways_to_help_the_people/","comments":[]}]},{"timestamp":1645977636679,"author":"reddit:RussiaUkraineWar2022/SulejmanYT","title":"Kiev is unlikely to fall","content":"The longer the war goes on, more desperate will Putin become. When Yugoslav army invaded Croatia, at the siege of Vukovar, there were only 2000 defenders against 40000 attackers. Vukovar was reduced to ashes, genocide afterwards. Defenders held for 40 days before it fell. In comparison, Vukovar at that time had 40000 people living there, Kyiv has 2,8 mil. Putin and Russian army are affraid of street warfare and they should be. That's where they break their own spine.","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/RussiaUkraineWar2022/comments/t2nq5y/kiev_is_unlikely_to_fall/","comments":[]}]},{"timestamp":1645977636679,"author":"reddit:RussiaUkraineWar2022/T90Vladimir","title":"Are the Russians using any tactics? Certainly seems like their commanders are sleeping!","content":"In many videos I see tanks and vehicles driving through the cities with zero infantry support. Just saw a video of the TOS-1 being escorted by a single BTR. Why? Where is the infantry? Is there any meaningful infantry combat going on, or is it just Ukranians shooting AT stuff at tanks?","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/RussiaUkraineWar2022/comments/t2p80y/are_the_russians_using_any_tactics_certainly/","comments":[]}]},{"timestamp":1645977636679,"author":"reddit:RussiaUkraineWar2022/AnnualCulture3296","title":"Гражданский со своими собаками убит русскими. Совершенно мерзкое и отвратительное, бесчеловечное поведение.","content":"https://www.reddit.com/r/ukraine/comments/t2n4ot/civilian_with_his_dogs_murdered_by_the_russians/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/RussiaUkraineWar2022/comments/t2ply5/гражданский_со_своими_собаками_убит_русскими/","comments":[]}]},{"timestamp":1645977636798,"author":"reddit:RussianWarCrimes/jbeising","title":"Join this additional sub to post war crimes","content":"Just saw that an additional sub was created by someone else today to document Russian war crimes. I directed them here, but wanted to cross post theirs too so everyone can be together. r/kremlinarchives","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/russianwarcrimes/comments/t15p26/join_this_additional_sub_to_post_war_crimes/","comments":[]}]},{"timestamp":1645977636798,"author":"reddit:RussianWarCrimes/BaronVonSaron","title":"There should be a backup site","content":"We should make something such as a discord server or something else in case this sub gets taken down.","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/russianwarcrimes/comments/t17k45/there_should_be_a_backup_site/","comments":[]}]},{"timestamp":1645977636798,"author":"reddit:RussianWarCrimes/Uranium_Donut_","title":"r/RussiaDemoralize - A collection of truthful media to demoralize Russian soliders and Russia-affiliates","content":"I created a subreddit, to collect all media, which can aid in demoralizing and changing the minds of propaganda fed Russians.    \n\nhttps://www.reddit.com/r/RussiaDemoralize/\n\nPost content and add the appropriate text into your comments.\n\n&amp;#x200B;\n\nWhat makes this https://www.reddit.com/r/RussiaDemoralize/ different from this one? Every post is accompanied by a text in Russian. Ready to be distributed to all social Media.","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/russianwarcrimes/comments/t1u7h5/rrussiademoralize_a_collection_of_truthful_media/","comments":[]}]},{"timestamp":1645977636798,"author":"reddit:RussianWarCrimes/Mammoth-Winter-7768","title":"Russian \"flamethrower\" thermobaric weapon being moved into Ukraine.","content":"https://www.youtube.com/watch?v=GCsycTW8mGc","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/russianwarcrimes/comments/t26cxp/russian_flamethrower_thermobaric_weapon_being/","comments":[]}]},{"timestamp":1645977685987,"author":"reddit:ukraine/MekhaDuk","title":"Don't be alarmed about peace talks","content":" zelensky will not approve anything against the ukrainian people, additional time will be gained for aid coming from the west and integration into the army.\n\nMore time: More stingers,More javelins,More resources,More ammo and More time to resistance.","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ukraine/comments/t2r8im/dont_be_alarmed_about_peace_talks/","comments":[]}]},{"timestamp":1645977726421,"author":"reddit:ukraine/Ogami-kun","title":"Upcoming pace talks (Hopefully)","content":"Ukraine has agreed to talks with Russia on the Belarusian-Ukrainian border, President Volodymyr Zelenskiy said in a Facebook post; this post is made to brainstorm possible condition and if they can be accepted  by either party\n\nPlease keep the answers logical and civil, I am with ukraine, but I would prefer for ukrainians to live rather than to have all die in vengeance\n\nNow; obviously to consider the peace conditions we need to consider the situation and the 'supposed' reason the war started; again, trying to be as neutral as possible.\n\nZelenskiy: \n\n* Putin said his goverment has been racist, nazi, whatever, and didn't recognize Donetsk and Luhansk as Republics; \n* Apparently he attacked first sending missiles in Donetsk and Luhansk i think the russian said?\n\nPutin: \n\n* Nato bordering just near Russia is a danger for Russia itself, so Ukraine should be neutral territory\n* Ukraine being armed is a danger for Russia, it should completely demilitarize\n* He admitted of wanting to regain the territories the USSR had\n* In a bout of generousness and most benevolence Putin has decided to aid Donetsk and Luhansk to be recognized as Republics; ukraine refused\n* Zelenskiy, that has hebrew roots, and if i recall correctly himself hebrew, just like his Prime minister, is apparently a dangerous and rabid racist, with politics against Russians and minorities that are reminiscing of Hitler\n\nI might be missing some, please PM me if I forgot to add something, and just for that.\n\nPoints of order:\n\n* The reason Donetsk and Luhansk have not been recognized as republics is simply because they have been economically dependant on Russia, so they are not recognized as republics from an international point of view\n* Russia is not, technically, the USSR\n* Confusion on whether or not racial discrimination happened\n* Russia not only \"military assisted\" Donetsk and Luhansk but actually attacked and occupied a sovereign country\n* Ukraine was unprepared for the assault\n* Multiple sanctions from Nato and the rest of the world, SWIFT ban \n* Russia has nukes, NATO has nukes too, although less willing to use\n* Face: Putin remains in power showing people from around the world listen to him, he cannot admit complete defeat or retreat, otherwise he risks losing support from both russians and the oligarchs. Partial victory he can probably work with, considering his propaganda\n* Ukraine has been violently scarred; it will not return like pre-invasion for many years to come\n\nAgain; I might be missing some, please PM me if I forgot to add something, and just for that.\n\n# Discussion: What can be the reasonable terms of peace? \n\n^(Reasonable, as neither russian troops rebuilding houses out of their pockets before sprinting home with Putin dropping dead nor Ukraine pledging allegiance to the russia flag)","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ukraine/comments/t2r91m/upcoming_pace_talks_hopefully/","comments":[]}]},{"timestamp":1645977747304,"author":"reddit:ukraine/Rickk020","title":"People of Ukraine.","content":"Loving people of Ukraine and the hero warriors of the Ukrainian Army. \n\nThe russian soldiers that you capture can never be sent back to Russia, they will be killed for deserting/surrendering. \n\nIt is not easy. But they have to be treated well. Maybe they can be converted to fight for you guys, since the Russian army has no justified cause, but the Ukrainian army and it's though people have one.\n\nGlory to Ukraine! Glory to the heroes","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ukraine/comments/t2r98d/people_of_ukraine/","comments":[]}]},{"timestamp":1645977757646,"author":"reddit:ukraine/Chojyugiga","title":"Please retweet Vice Prime Minister of Ukraine and Minister of Digital Transformation of Ukraine request","content":"  \nVice Prime Minister of Ukraine and Minister of Digital Transformation of Ukraine\n\nfrom an hour ago  \n\n\n📷https://twitter.com/FedorovMykhailo· Mark Zuckerberg, while you create Metaverse — Russia ruins real life in Ukraine! We ask you to ban access to https://twitter.com/facebookapp and https://twitter.com/instagram from Russia — as long as tanks and missiles attack our kindergartens and hospitals! https://twitter.com/Meta.","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ukraine/comments/t2r9bq/please_retweet_vice_prime_minister_of_ukraine_and/","comments":[]}]},{"timestamp":1645977787285,"author":"reddit:ukraine/byteseed","title":"Russian army marks definition!","content":"I have seen several comments asking what those letter marking means:\n\n Z - Eastern forces of the Russian Federation.\n\n Z squared - forces from the Crimea.\n\n O - forces from Belarus.\n\n V - Marines.\n\n X - Chechens.\n\n A - special force (SOBR, ALPHA, SSO).\n\nSource: \nhttps://www.facebook.com/701154173263818/posts/5056732711039254/?d=n\n\nThe military TV of Ukraine.","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ukraine/comments/t2r9s7/russian_army_marks_definition/","comments":[]}]},{"timestamp":1645977808141,"author":"reddit:ukraine/mshthn","title":"The end is near for Putin. I give him less than 3 months.","content":"This isn't an election, so his approval rate amongst Russian pensioners and boomers isn't relevant. The country doesn't support his war  - just look at the protests against it from Novosibirsk to St Petersburgh. It's important to notice that only the bravest people go out and raise their voices in Russia because of the oppression. The protests in Russia that you see in the news are just the tip of the iceberg.\n\nTomorrow, on Monday, a brand new kind of shitstorm will begin. Outside the country the price of Rubel will crash, causing even bigger problems for their economy. Inside, there's a great chance that the financial system and the banks will grind to a halt due to people panicking in just a matter of days. That, on top of getting banned from SWIFT will be disastrous. They will be finding it eerily familiar from the 1980s: scarcity of goods, produce, everything.  A great deal of just about nothing to buy in the Gum Univerzalniy Magazin.\n\nSoon, the wealthy people of the Russian society will realize that days of power, wealth, and prosperity are over. They are out of luck. Not only they are losing their properties, investments abroad, not only they can't escape anymore from the harsh and depressing Russian reality to a tropical island, but they are losing their internal market as well.\n\nThis is when networks will be playing a vital role. These people of economic power will find their way to officers of the Russian Army. They will start talking. Lots of news already showed that the morale in Putin's army is probably very low. Putin must know this too, that's why he was aiming for a Blitzkrieg. But these are Russians, not Germans. Russian soldiers living under circumstances most people living in the west can't even imagine. \n\nThe Blitzkrieg didn't happen and Ukraine can cause damage to Russian troops most of us didn't even dare to believe. They are failing on massive, unimaginable levels.\n\nToday, as it's been quite likely, he put their nuclear forces on high alert. This will turn up the protests internally, the sirens will go off even in some military men's head, while not even shaking the unity of the west the tiniest bit. No one will blink an eye. More protests will bring on more oppression, police forces will be overwhelmed soon, while still being underpaid, living in near poverty.\n\nEconomic elite will quickly find the common interests with the military elite. Someone will flip. And then more. On high levels. Putin will start to act like a loose cannon, firing at everyone and anyone. Then on the nicest day in 2022, he will be overthrown. From a rock solid position, just because he underestimated how much the world hates fucking nazis.","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ukraine/comments/t2ra1n/the_end_is_near_for_putin_i_give_him_less_than_3/","comments":[]}]},{"timestamp":1645977866448,"author":"reddit:ukraine/madlass_4rm_madtown","title":"True colors","content":"We are beginning to see the true colors of many people, like Musk getting Starlink going for Ukraine, what are some other examples you are seeing?","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ukraine/comments/t2raus/true_colors/","comments":[]}]},{"timestamp":1645977876836,"author":"reddit:CombatFootage/Ryanskillz","title":"Where is the advanced Russian equipment? Tactics? Overwhelming force? The U.S would absolutely obliterate this show of force. The threat of nuclear is all that stops us.","content":"These guys can't even refuel properly, weapons look like ww2 Era. Troops look 19-22 mostly. They are getting pushed back by basic anti-tank and anti-air? Are they sandbagging or really this weak?","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/CombatFootage/comments/t2rb06/where_is_the_advanced_russian_equipment_tactics/","comments":[]}]},{"timestamp":1645977946831,"author":"reddit:ukraine/Caramello_rotmg","title":"Putin putting nukes on high alert as western sanctions on Russia and assistance for Ukraine continues","content":"Not sure if this has been posted yet","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ukraine/comments/t2rbxr/putin_putting_nukes_on_high_alert_as_western/","comments":[]}]},{"timestamp":1645978076902,"author":"reddit:ukraine/consci0usness","title":"A warning to Ukraine about the coming night(s), be ready for the dirtiest and most brutal of tactics yet.","content":"Economic sanctions are starting to hit Russia hard, the entire world warned Russia about these sanctions but Russia went ahead and attacked anyway.\n\nThe assets of many oligarchs are being seized and frozen, Russian banks are being disconnected from Swift, international companies will no longer do business with Russia, airlines will no longer fly to Russia, Russian visas are being revoked, many official Russian websites are down. Even western social media is starting to block Russia. The entire world is uniting against this unlawful attack against the sovereign democratic nation that is Ukraine.\n\nTomorrow morning EU stock markets will open, about 6h later the US stock market will open, it will be tumultuous. I'm sure the Russian central bank will do its best to prop everything up, but that can only go on for so long. If this continues either the Russian stock market will collapse or the Russian ruble will succumb to hyperinflation.\n\nThis can't go on for long before the entire Russian economy crumbles, the Russian economy was never great but its now going downhill fast. Putin is now getting desperate and will do everything in his power to end this conflict quickly.\n\nStay safe and be ready for anything, you are now facing an increasingly desperate enemy. Don't trust anything Russia says or promises. Be ready for air strikes. Be ready for dirty tactics. Don't sleep without cover or guard. You have God on your side and the world at you back.\n\nSlava Ukraini.","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ukraine/comments/t2rdlr/a_warning_to_ukraine_about_the_coming_nights_be/","comments":[]}]},{"timestamp":1645978116956,"author":"reddit:ukraine/MrAyahuasca","title":"Suggestions of peace talks are a joke and you'd have to be deluded to think anything good would come of them","content":"Putin has too big an ego to back down from this. He's not going to go down without a fight, so why would he entertain peace talks? It's complete nonsense. Not to mention, entertaining talks sets a precedent that what Russia has done is warranting negotiation. Fuck that. Whatever Russia would offer at this stage would never be worthy of consideration anyway, so why listen to anything they have to say at all? \n\nThe actions of Putin are so reprehensible and he has to be made to pay for them properly. The only way for that to happen is for his invasion to be crushed without mercy, so he's forced to retreat and reap the consequences of sanction and political/civil revolt.","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ukraine/comments/t2re6t/suggestions_of_peace_talks_are_a_joke_and_youd/","comments":[]}]},{"timestamp":1645978197079,"author":"reddit:ukraine/JupiterQuirinus","title":"Why it is so hard to estimate Russian losses","content":"This is from one of the best assessors of battlefield losses of the modern era.\n\n\"I’m trying my best to incorporate equipment losses of both sides as fast as possible, but the Russian Army is simply losing too much equipment for me to keep up. I’ve made lists for Afghanistan, Syria and Nagorno-Karabakh, but this is just insane. Absolute meat grinder.\"\n\nhttps://twitter.com/oryxspioenkop/status/1497953304378327043","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ukraine/comments/t2rf40/why_it_is_so_hard_to_estimate_russian_losses/","comments":[]}]},{"timestamp":1645978227161,"author":"reddit:ukraine/MekhaDuk","title":"About the Nukes","content":"Nuclears that were not used even at the height of the cold war will not be used now.\n\nI believe that if Putin decides to use nuclear weapons, he will be killed in a coup or assassination without implementing it. What do you think about this?","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ukraine/comments/t2rfmu/about_the_nukes/","comments":[]}]},{"timestamp":1645978347450,"author":"reddit:ukraine/TerryBahoon","title":"30s couple in London offering a room for refugees","content":"My country is now apparently taking in refugees so we are offering a room out to anyone who has made it here and needs shelter. We have a room in our place in Hackney, it’s a bit scrappy but you will be warm and fed. DM me.","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ukraine/comments/t2rh3u/30s_couple_in_london_offering_a_room_for_refugees/","comments":[]}]},{"timestamp":1645978367626,"author":"reddit:CombatFootage/catemoji23","title":"This thread is becoming too biased","content":"I’m pro Ukraine but I see alot of posts that show any Russian superiority or Ukrainean weakness getting deleted. This misleads everyone that trusts this thread and you are no better than the Russian brainwashing media. Please stop this messed up censorship and insane bias. Trust, we can tell.","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/CombatFootage/comments/t2rhev/this_thread_is_becoming_too_biased/","comments":[]}]},{"timestamp":1645978446270,"author":"reddit:ukraine/OG_Squeekz","title":"While I'm in Ukraine my mother is hand sewing flags in California.","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://i.redd.it/qqo0dioqfek81.jpg","comments":[]}]},{"timestamp":1645978446270,"author":"reddit:ukraine/NORDLAN","title":"Hanna Liubakova on Twitter","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://mobile.twitter.com/hannaliubakova/status/1497940326832656384","comments":[]}]},{"timestamp":1645978446270,"author":"reddit:ukraine/cherrypopper666","title":"I think it’s long overdue for the Russian people to take their freedom and reenact Mussolini’s final moments","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://i.redd.it/qz5wwuavfek81.jpg","comments":[]}]},{"timestamp":1645978446270,"author":"reddit:ukraine/idk_what_a_name_is","title":"Russian aircraft passing through the airspace of 6 countries they aren't allowed to be in: France, Belgium, the Netherlands, Denmark, Sweden and Finland","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://i.redd.it/ds7knhy2gek81.png","comments":[]}]},{"timestamp":1645978446270,"author":"reddit:ukraine/HappyZavulon","title":"И эти пропагандоны отскочили","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://v.redd.it/rxhcyfpfgek81","comments":[]}]},{"timestamp":1645978446270,"author":"reddit:ukraine/Old_Huckleberry_7983","title":"Artists from Georgia created a fundraiser for Ukrainians","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/gallery/t2rfgp","comments":[]}]},{"timestamp":1645978446270,"author":"reddit:ukraine/Rodhya","title":"Blue Skies over a field of wheat.","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://i.redd.it/oxy1aystgek81.jpg","comments":[]}]},{"timestamp":1645978446270,"author":"reddit:ukraine/WalkerBuldog","title":"-2 Russian fighters","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://v.redd.it/ykfvw3zrgek81","comments":[]}]},{"timestamp":1645978446271,"author":"reddit:ukraine/Did-ko","title":"🌻🌻🌻🌻🌻","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://i.imgur.com/dTwClcn.jpg","comments":[]}]},{"timestamp":1645978446271,"author":"reddit:ukraine/lost_in_trepidation","title":"[U.S. Senator Marco Rubio] \"#Putin “negotiations” are simply another tool in his military arsenal. He will use them to buy time to move reinforcements &amp; rebuild supply lines\"","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://twitter.com/marcorubio/status/1497966910872379392","comments":[]}]},{"timestamp":1645978446271,"author":"reddit:ukraine/andon_","title":"Berlin today ~ 100,000 people showing respect and solidarity to Ukrainians wishing Putin to stop aggression immediately","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/gallery/t2rhvq","comments":[]}]},{"timestamp":1645978446271,"author":"reddit:ukraine/xCastieL007","title":"Ukraine-Russia talks will happen Monday, Ukrainian official says","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://mosttraded.com/2022/02/27/ukraine-russia-talks-will-happen-monday-ukrainian-official-says/","comments":[]}]},{"timestamp":1645978446468,"author":"reddit:UkraineWarReports/betterbuilder7","title":"Two planes were shot down in Balakylia half an hour ago, the pilots managed to eject, according to incoming reports.","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://v.redd.it/yip6az856ek81","comments":[]}]},{"timestamp":1645978446468,"author":"reddit:UkraineWarReports/callmynmae143","title":"UKRANIAN SOLDIERS BEATING INDIAN STUDENTS WHO ARE TRYING TO CROSS BORDER. they are not allowed and being pushed back. seems like the govt is trying to use them as hostage for indian support at international forums. shameful","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://v.redd.it/k3bxipjy6ek81","comments":[]}]},{"timestamp":1645978446468,"author":"reddit:UkraineWarReports/betterbuilder7","title":"Airstrike on Berezovka.","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://v.redd.it/ux1hlpgxaek81","comments":[]}]},{"timestamp":1645978446468,"author":"reddit:UkraineWarReports/betterbuilder7","title":"Russian forces in Borodyanka, west of Kyiv. Highway E373. 50.639883, 29.917819","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://v.redd.it/8lv5yu0nbek81","comments":[]}]},{"timestamp":1645978446468,"author":"reddit:UkraineWarReports/betterbuilder7","title":"Powerful explosions near the airport in Zhytomyr right now!","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://v.redd.it/y2lz3y2wcek81","comments":[]}]},{"timestamp":1645978446468,"author":"reddit:UkraineWarReports/Vaclavzaycev","title":"Shelter Kharkov Ukraine. We no have way for run away","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/gallery/t2r09x","comments":[]}]},{"timestamp":1645978446468,"author":"reddit:UkraineWarReports/johnny_b_good1234","title":"Toasted Russian meat. Or grilled. Ribs anyone?","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://twitter.com/XyKyiv/status/1497530792687329281?t=-Jz_60wPm1Xwe0hiYxHHHA&amp;s=19","comments":[]}]},{"timestamp":1645978446468,"author":"reddit:UkraineWarReports/Double-Programmer-36","title":"Russian troops looting a grocery store in Kharkov 27.02.2020","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://youtu.be/ZIsa0lr1s8Q","comments":[]}]},{"timestamp":1645978446468,"author":"reddit:UkraineWarReports/Citynews2022","title":"World’s largest cargo aircraft destroyed by Russian air attack","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.cityam.com/sources-world-largest-cargo-aircraft-destroyed-russian-air-attack/","comments":[]}]},{"timestamp":1645978446468,"author":"reddit:UkraineWarReports/jeremyoudo716","title":"Residents of Severodonetsk are asking the soldiers of the Armed Forces of Ukraine to take armored vehicles away from residential areas: \"We have basements full of children\".","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://v.redd.it/iey2l1z9fek81","comments":[]}]},{"timestamp":1645978446469,"author":"reddit:UkraineWarReports/jeremyoudo716","title":"The Sparta battalion is moving towards Bugas, Volnovakha district.","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://v.redd.it/b74vwzmrfek81","comments":[]}]},{"timestamp":1645978446469,"author":"reddit:UkraineWarReports/SmokeSinseLoud","title":"@nexta_tv claims that two missiles were launched from Mazyr, Belarus.","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://v.redd.it/j6u2dyppcek81","comments":[]}]},{"timestamp":1645978446469,"author":"reddit:UkraineWarReports/Puzzleheaded-Ant-459","title":"Lama sighted","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://i.redd.it/0n5eyi27hek81.jpg","comments":[]}]},{"timestamp":1645978446641,"author":"reddit:RussiaUkraineWar2022/SmokeSinseLoud","title":"Russian Buk surface-to-air missile systems in Berdyansk","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://i.redd.it/1oqu1g5x0ek81.jpg","comments":[]}]},{"timestamp":1645978446641,"author":"reddit:RussiaUkraineWar2022/SmokeSinseLoud","title":"Destroyed / abandoned Russian Tigers and a burning Ukrainian BTR after battles in Kharkiv this morning","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://i.redd.it/zmed9ooh1ek81.png","comments":[]}]},{"timestamp":1645978446641,"author":"reddit:RussiaUkraineWar2022/Dependent_Actuary148","title":"Only Russian people have the power to end it","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://i.redd.it/ow531i3o1ek81.jpg","comments":[]}]},{"timestamp":1645978446641,"author":"reddit:RussiaUkraineWar2022/Low_Ant_7523","title":"Destroyed Russian Convoy","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://youtu.be/vRI07-I-mWM","comments":[]}]},{"timestamp":1645978446641,"author":"reddit:RussiaUkraineWar2022/SmokeSinseLoud","title":"Russian T-72!","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://v.redd.it/geyp6oae4ek81","comments":[]}]},{"timestamp":1645978446641,"author":"reddit:RussiaUkraineWar2022/SmokeSinseLoud","title":"Ukrainian BRDM-2 destroyed in Volnovakha area","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://i.redd.it/yw2vbjqn4ek81.jpg","comments":[]}]},{"timestamp":1645978446641,"author":"reddit:RussiaUkraineWar2022/SmokeSinseLoud","title":"Yesterday on the Kherson front, possibly as a result of a Ukrainian Su-25 strafing run, Russian forces lost a BMP-2, a R-149 series command vehicle, and a couple of BMD-2 based vehicles, possibly BTR-D. Footage was took today, however.","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/gallery/t2q39n","comments":[]}]},{"timestamp":1645978446641,"author":"reddit:RussiaUkraineWar2022/SmokeSinseLoud","title":"Russian MT-LB destroyed in Nova Kakhova","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://v.redd.it/1b336exk6ek81","comments":[]}]},{"timestamp":1645978446641,"author":"reddit:RussiaUkraineWar2022/SmokeSinseLoud","title":"Russian T-90 is now a submarine in Sumy, that must have been a gruesome, slow death for the crew of this tank.","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://i.redd.it/iw5d6dus6ek81.jpg","comments":[]}]},{"timestamp":1645978446641,"author":"reddit:RussiaUkraineWar2022/SmokeSinseLoud","title":"👌","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://i.redd.it/dadshtnx7ek81.jpg","comments":[]}]},{"timestamp":1645978446641,"author":"reddit:RussiaUkraineWar2022/LingonberryThick6219","title":"To realise the heroism of Ukraine🇺🇦","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://i.redd.it/cdnna48g8ek81.jpg","comments":[]}]},{"timestamp":1645978446641,"author":"reddit:RussiaUkraineWar2022/SmokeSinseLoud","title":"United States assesses that Russia is starting to adopt siege tactics inside Ukraine, “it increases the likelihood of collateral damage to civilian infrastructure and life” -U.S. Official.","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/RussiaUkraineWar2022/comments/t2qgyh/united_states_assesses_that_russia_is_starting_to/","comments":[]}]},{"timestamp":1645978446641,"author":"reddit:RussiaUkraineWar2022/MrAutoFem","title":"And this is the road between Bucha and Irpin. Part of my usual bike route in the Kyiv region. Today it is a Russian Death Valley.","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://v.redd.it/lzty81uu8ek81","comments":[]}]},{"timestamp":1645978446641,"author":"reddit:RussiaUkraineWar2022/No_Delay5284","title":"EU, U.K., Canada, U.S. Plan to Cut Some Russian Banks From Swift","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.wsj.com/articles/eu-leaders-weigh-cutting-russia-out-of-global-payment-system-swift-11645888337?mod=markets_lead_pos1","comments":[]}]},{"timestamp":1645978446641,"author":"reddit:RussiaUkraineWar2022/MrAutoFem","title":"Here's Putin just now ordering Russia's deterrence (nuclear) forces on \"a special regime of duty\" in response to foreign sanctions. It's a DEFCON situation.","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://v.redd.it/qnt80v98ndk81","comments":[]}]},{"timestamp":1645978446641,"author":"reddit:RussiaUkraineWar2022/SmokeSinseLoud","title":"Russian rocket killing (not confirmed) 14 year old girl","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://v.redd.it/fre0hgbes2k81","comments":[]}]},{"timestamp":1645978446641,"author":"reddit:RussiaUkraineWar2022/Low_Ant_7523","title":"Burning Russian Equipment","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://youtu.be/mtFeA9Fs56A","comments":[]}]},{"timestamp":1645978446641,"author":"reddit:RussiaUkraineWar2022/SmokeSinseLoud","title":"@nexta_tv claims that two missiles were launched from Mazyr, Belarus.","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://v.redd.it/j6u2dyppcek81","comments":[]}]},{"timestamp":1645978446641,"author":"reddit:RussiaUkraineWar2022/SmokeSinseLoud","title":"Airstrike in Berezovka in the Odessa region","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://v.redd.it/m8arszmtcek81","comments":[]}]},{"timestamp":1645978446641,"author":"reddit:RussiaUkraineWar2022/Slight-Response5989","title":"When all this will stop","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://v.redd.it/ru9myhvwdek81","comments":[]}]},{"timestamp":1645978446641,"author":"reddit:RussiaUkraineWar2022/SmokeSinseLoud","title":"We went for the commander, and now we arrived. A few more invaders were taken prisoner.","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://v.redd.it/n62ohyq6zdk81","comments":[]}]},{"timestamp":1645978446641,"author":"reddit:RussiaUkraineWar2022/SmokeSinseLoud","title":"Ukrainians recovering dead/wounded in Irpen","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://v.redd.it/acyw98vpzck81","comments":[]}]},{"timestamp":1645978446641,"author":"reddit:RussiaUkraineWar2022/EngineeringQuiet2918","title":"BREAKING The world’s biggest aircraft Antonov An-225 Mriya has been destroyed","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://i.redd.it/o8cb4v0cgek81.jpg","comments":[]}]},{"timestamp":1645978446641,"author":"reddit:RussiaUkraineWar2022/su5577","title":"Ukrainian forces beating Indian students and firing shots in air at poland - Ukrainian border.","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://v.redd.it/ivzdzyfoudk81","comments":[]}]},{"timestamp":1645978446675,"author":"reddit:russia/rolf_odd","title":"Professor John J. Mearsheimer, University of Chicago, interviewed by students at Cambridge university on the situation in Russia and Ukraine (February 15. 2022)","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.youtube.com/watch?v=Nbj1AR_aAcE","comments":[]}]},{"timestamp":1645978446675,"author":"reddit:russia/Proper-Sock4721","title":"Senior Executive at NBC wants Russian internment camps.","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://i.imgur.com/yshf0GW.png","comments":[]}]},{"timestamp":1645978446675,"author":"reddit:russia/jackedupand55","title":"US: starts 81% of wars after ww2 to steal natural resources. GOOD. Russia starts a war just like the US tried in Cuba to defend it self: BAD.","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://i.redd.it/1nsvhgc9ddk81.png","comments":[]}]},{"timestamp":1645978446675,"author":"reddit:russia/jackedupand55","title":"One of the hundreds of Genocide started by NATO, but nobody gives a shit because Nonwhite/Muslims/poor people are getting killed.","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.youtube.com/watch?v=dZTe-y8Ubbk&amp;ab_channel=MuhammadIsmail","comments":[]}]},{"timestamp":1645978446675,"author":"reddit:russia/jackedupand55","title":"US: RUSSIA IS EVIL AND MUST BE STOPPED, how poor countries invaded by the West sees Russia.","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.youtube.com/watch?v=PVZehWXvVx8&amp;ab_channel=africanews","comments":[]}]},{"timestamp":1645978446675,"author":"reddit:russia/Ok-Mix7390","title":"The tweet of the Chinese embassy in Moscow - 'Never forget who is a real threat to the world'","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://i.redd.it/abez0d6gfdk81.png","comments":[]}]},{"timestamp":1645978446675,"author":"reddit:russia/Moon4503","title":"Hypocrisy","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://i.redd.it/wcr02ptihdk81.jpg","comments":[]}]},{"timestamp":1645978446675,"author":"reddit:russia/rx303","title":"Война на Украине (27.02.22 на 15:00)","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://youtu.be/X3Ai1EVe5xQ","comments":[]}]},{"timestamp":1645978446675,"author":"reddit:russia/Stand_With_Ru","title":"Russia is Fighting a War of Self-Preservation","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.youtube.com/watch?v=HqlUns7KfwY&amp;ab_channel=TheNewAtlas","comments":[]}]},{"timestamp":1645978446675,"author":"reddit:russia/Stand_With_Ru","title":"Kiev's brave defenders protecting the capital from its own residents","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.youtube.com/shorts/h3sAGjYi_Pg","comments":[]}]},{"timestamp":1645978446675,"author":"reddit:russia/WeaponH_","title":"Captured Ukranian soldiers forced to see a monument of the children killed by the Armed Forces of Ukraine in Donbass","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://v.redd.it/54c8xdj4pdk81","comments":[]}]},{"timestamp":1645978446675,"author":"reddit:russia/Leena_Lenovich","title":"Mayor of Ukranian city of Henichesk","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://v.redd.it/v0bftinnrdk81","comments":[]}]},{"timestamp":1645978446675,"author":"reddit:russia/Leena_Lenovich","title":"What touches Russian soul? What russians thinking right now? This. Stirlitz day dream on his way to Berlin. If you can undarsand this, you are ready to understand Russians right now.","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.youtube.com/watch?v=WKzkMGfaBPg","comments":[]}]},{"timestamp":1645978446675,"author":"reddit:russia/chewbacca81","title":"Man proudly filming how much \"Ukrainian\" army is winning, until Russian soldiers, who now control the area, take his phone away.","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://v.redd.it/gawfh12azdk81","comments":[]}]},{"timestamp":1645978446675,"author":"reddit:russia/Turbolife_travel","title":"The whole essence of Russia is in one video. What Russians are really thinking","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://youtu.be/8RToAzIAIRc","comments":[]}]},{"timestamp":1645978446675,"author":"reddit:russia/jackedupand55","title":"Just like the ghost of Kiev, here is the fish of Kiev. You gotta be a certain level of \"smart\" to fall for that...","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://i.redd.it/ejn2lcvh7ek81.jpg","comments":[]}]},{"timestamp":1645978446675,"author":"reddit:russia/Plenox","title":"Ukrainian soldiers from Snake Island are alive and well in Sevastopol after giving themselves up to Russian Navy","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://youtu.be/MXpzq0kkpfo?t=496","comments":[]}]},{"timestamp":1645978446675,"author":"reddit:russia/WorldPoster","title":"Ukrainian forces beating up Indian students and firing shots in air at Polish/Ukrainian borders","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://v.redd.it/875hlj81fek81","comments":[]}]},{"timestamp":1645978446974,"author":"reddit:RussianWarCrimes/FreeWing","title":"Can anyone verify if this happened in Mariupol? If it's fake or from something completely different I'll take it down.","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://v.redd.it/raazrjqg28k81","comments":[]}]},{"timestamp":1645978446974,"author":"reddit:RussianWarCrimes/GreyJedi56","title":"Russian rocket in Kyiv.","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://v.redd.it/up9epwog45k81","comments":[]}]},{"timestamp":1645978446974,"author":"reddit:RussianWarCrimes/BlankVerse","title":"During the rocket attacks on Kyiv, Russian shells hit the nuclear waste disposal site of the Kyiv branch of the State Specialized Enterprise Association Radon. It is currently impossible to estimate the extent of the damage — the automated radiation monitoring system has failed","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://twitter.com/Hromadske/status/1497747965984841731","comments":[]}]},{"timestamp":1645978446974,"author":"reddit:RussianWarCrimes/Firm-Display9423","title":"ukraine civilian were killed by russia troops (TW dead dog)","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://v.redd.it/ueeojtkrhbk81","comments":[]}]},{"timestamp":1645978446974,"author":"reddit:RussianWarCrimes/GreyJedi56","title":"Russian invaders killed civilian family and dogs","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://v.redd.it/3hefkebvrbk81","comments":[]}]},{"timestamp":1645978446974,"author":"reddit:RussianWarCrimes/GreyJedi56","title":"Russian troops robbing a bank in Ukraine","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://v.redd.it/73k50xc3xck81","comments":[]}]},{"timestamp":1645978446974,"author":"reddit:RussianWarCrimes/GreyJedi56","title":"Update 13:13 Defense","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://i.redd.it/tyh8djyxzck81.jpg","comments":[]}]},{"timestamp":1645978446974,"author":"reddit:RussianWarCrimes/GreyJedi56","title":"Terrible civilian losses today in Donetsk oblast as a result of RU shelling. 19 dead and 73 wounded. Stop shelling civilians, you bastards!","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/gallery/t2h9pj","comments":[]}]},{"timestamp":1645978446974,"author":"reddit:RussianWarCrimes/GreyJedi56","title":"If you see these do NOT pick them up. They may be green, brown, sand colored, etc -- they make them in a variety of colors. They are carpet-bomb-style dropped and activate about 40 minutes after landing. They are designed to maim, not kill; Russia wants to jam up medical services to Ukranians.","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://i.redd.it/ag8fe63gsak81.jpg","comments":[]}]},{"timestamp":1645978456195,"author":"reddit:ukraine/NORDLAN","title":"Russia Today hit by resignation of several UK-based journalists after Ukraine invasion","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://inews.co.uk/news/world/russia-today-resignation-several-uk-journalists-within-hours-putins-invasion-of-ukraine-1486142/amp","comments":[]}]},{"timestamp":1645978456623,"author":"reddit:RussiaUkraineWar2022/SmokeSinseLoud","title":"Fighting in Kharkiv reported earlier on","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://v.redd.it/ht0jldd9hek81","comments":[]}]},{"timestamp":1645978466174,"author":"reddit:ukraine/shreyasbela23","title":"New video from President Zelenskiy. Talking about Belarus and new updates. (Not subbed yet, if anyone can translate it would be great)","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://v.redd.it/g2v00c7wgek81","comments":[]}]},{"timestamp":1645978476342,"author":"reddit:ukraine/ctoph","title":"Is there any attempt to funnel weapons to supporters of opposition in Belarus?","content":"Seems like a time when motivation to act is at an all time high and ability of Russia and Belarus to respond would be at an all time low.","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ukraine/comments/t2rit6/is_there_any_attempt_to_funnel_weapons_to/","comments":[]}]},{"timestamp":1645978486580,"author":"reddit:ukraine/ilikerwd","title":"Morale and motivation matter more than weapons. Ukraine will win this war!","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ukraine/comments/t2riuu/morale_and_motivation_matter_more_than_weapons/","comments":[]}]},{"timestamp":1645978486580,"author":"reddit:ukraine/MrCircleStrafe","title":"Update to the tool I built to help Ukrainians easily let their family know that they are safe.","content":"Hey, British software engineer here again. This is a follow up to the post I did back on Friday about a piece of software I've built to help displaced Ukrainian citizens quickly find out if their loved ones are safe.\n\nTool is here: https://www.amisafe.info/\n\nLast post is here: https://www.reddit.com/r/ukraine/comments/t125ne/i_built_a_simple_page_for_ukraine_to_help_you_let/\n\nSince Friday there have been a number of updates based on recommendations from the community. Hopefully this helps to make the system more usable (and more fit for real purposes). Chiefly among these:  \n\n\n1. Higher level of security. This includes disabled server side network logging, proxying through Cloudflare and end to end encryption through SSL.\n2. Dark mode by default. It became clear that many would like to be able to use this application discreetly. This has been done.\n3. Ukrainian language support by default. If there are any Ukrainian speakers out there who wish for me to make any revisions to the language areas of the tool, please give me a DM.\n4. Server reset information. The system now tells you when the server last reset so that you are aware of when you need to recreate your user (in the case of a server reset).\n\nAs before. The software is entirely open source so you can review its credibility. My DMs are also always open for proof of my identity as well. Please review the previous reddit post for information about the code repositories if you want to contribute to this project yourself.\n\nI really hope this tool supports some of you well. If only one family finds some use from this, it will be worth it.\n\nPlease stay safe.","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ukraine/comments/t2rivt/update_to_the_tool_i_built_to_help_ukrainians/","comments":[]}]},{"timestamp":1645978486681,"author":"reddit:russia/erta_ale","title":"Western outlook towards students taken hostage. How low can so called humanitarians fall?","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://i.redd.it/e0263a6fbek81.jpg","comments":[]}]},{"timestamp":1645978496261,"author":"reddit:ukraine/bajspuss","title":"The Georgians refused to refuel the incoming Russian ship: “Russian ship, fuck you! You can use the oars!\"","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://v.redd.it/9d28kf69hek81","comments":[]}]},{"timestamp":1645978496603,"author":"reddit:CombatFootage/Mini_Operator","title":"Does anyone know any links of the Iraq War and people playing Death Metal on convoys through the city","content":"I remember seeing a video of them doing this while driving through a destroyed city and tall building surrounding them, but can't find the video anymore","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/CombatFootage/comments/t2rj0l/does_anyone_know_any_links_of_the_iraq_war_and/","comments":[]}]},{"timestamp":1645978496603,"author":"reddit:CombatFootage/-XxICExX-","title":"Two Russian jets shot down","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://v.redd.it/o6w1ycobhek81","comments":[]}]},{"timestamp":1645978496603,"author":"reddit:CombatFootage/Artul_man","title":"Does anyone have any info on why this happened?","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://v.redd.it/uoy966t6hek81","comments":[]}]},{"timestamp":1645978516610,"author":"reddit:ww3/Klaus-Haas","title":"This area of current Rus attack &amp; ctrl However actual photos/videos is rather non-existing. How come?","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/gallery/t2rj9m","comments":[]}]},{"timestamp":1645978536411,"author":"reddit:ukraine/ThatFaithlessness101","title":"Russian \"Iskanders\" were launched to Ukraine from the Belarusian territory even though Lukashenka promised to seize fire during the negotiation period.","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ukraine/comments/t2rjj2/russian_iskanders_were_launched_to_ukraine_from/","comments":[]}]},{"timestamp":1645978536411,"author":"reddit:ukraine/CertainTomatillo5287","title":"I am the one for the dark predictions","content":"Yes... dont want to show off but i predicted corona in januar 2020 and bought gold back then. (yeah was stupid, it crashed in march and so on, so yeah i am an investor and a nerd playing total war warhammer 3 until the world ends).\n\nanyways, here my latest dark prediction.\n\nThe NATO countries from the easy (lettland and so on) will get involved in the anti russia coalition founded by the ukraininians.\n\nRussia will start to use chemical weapons when the invasion fails.\n\nthis will lead to the USA to act.\n\nThen ??? but in the end the nukes will be dropped.  Since we dont know which countries are a thread (china , northkorea, russia, belarus)... we will just nuke everything.\n\nwho wants to play a round of total war warhammer (no joke)","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ukraine/comments/t2rjjv/i_am_the_one_for_the_dark_predictions/","comments":[]}]},{"timestamp":1645978536411,"author":"reddit:ukraine/Seleth044","title":"Free information on nuclear weapons, their damage and fallout.","content":"Outrider.org is a free website that has wonderful information on nuclear weapons. There you can actually see what happens when one is dropped wherever you want, as well as get information on what to expect before, during and after the blast. \n\nI hope no one ever actually needs this information.","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ukraine/comments/t2rjl2/free_information_on_nuclear_weapons_their_damage/","comments":[]}]},{"timestamp":1645978536941,"author":"reddit:RussiaUkraineWar2022/SmokeSinseLoud","title":"Ukrainian soldiers today in a disclosed location","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/gallery/t2rjln","comments":[]}]},{"timestamp":1645978576508,"author":"reddit:ukraine/WhatForIamHere","title":"Huilo completely crazy 😧","content":"(20) Putin orders deterrence forces — which includes nuclear arms — to be put on high alert\n\nhttps://edition.cnn.com/europe/live-news/ukraine-russia-news-02-27-22/h_4a1ba9fdfd7be4f72967c82918a4c21b?iid=cnn-mobile-app&amp;iid=cnn-mobile-app","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ukraine/comments/t2rk4z/huilo_completely_crazy/","comments":[]}]},{"timestamp":1645978586797,"author":"reddit:ukraine/ammofordays","title":"Mods, why are all the comments on posts being minimized and hidden?","content":"WTF mods? Change the settings back so people can actually see comments.","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.reddit.com/r/ukraine/comments/t2rk69/mods_why_are_all_the_comments_on_posts_being/","comments":[]}]},{"timestamp":1645978586797,"author":"reddit:ukraine/HLMenckenFan","title":"Ukrainian President Zelensky Agrees to Peace Talks, as Putin Puts Nuclear Forces on High Alert","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://www.thedailybeast.com/ukrainian-president-zelensky-agrees-to-peace-talks-as-putin-puts-nuclear-forces-on-high-alert?ref=home","comments":[]}]},{"timestamp":1645978637134,"author":"reddit:russia/jackedupand55","title":"Based China.","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://i.redd.it/gjs36pcxhek81.png","comments":[]}]},{"timestamp":1645978645510,"author":"reddit:ukraine/ComprehensiveSlip552","title":"Refugees can use german ICE trains to travel from the proud nation of Poland to the proud nation of Germany free of Charge","content":"You are our Brothers and are more than welcome to stay.\n\nSlava Ukraini","comments":[{"author":"SYSTEM","title":"Post source","content":"https://reddit.com//r/ukraine/comments/t2rkwt/refugees_can_use_german_ice_trains_to_travel_from/","comments":[]}]},{"timestamp":1645978655642,"author":"reddit:ukraine/astralcloud72","title":"Spread the word","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://reddit.com//r/ukraine/comments/t2rl3i/spread_the_word/","comments":[]}]},{"timestamp":1645978655642,"author":"reddit:ukraine/fungus_head","title":"Putin about the tactical situation in Ukraine","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://reddit.com//r/ukraine/comments/t2rl5e/putin_about_the_tactical_situation_in_ukraine/","comments":[]}]},{"timestamp":1645978655653,"author":"reddit:CombatFootage/-XxICExX-","title":"Ukrainian Air Force shot down most likely 2 Russian jets over the city of Balakliya.","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://reddit.com//r/CombatFootage/comments/t2rko0/ukrainian_air_force_shot_down_most_likely_2/","comments":[]}]},{"timestamp":1645978666076,"author":"reddit:RussiaUkraineWar2022/francisgane","title":"Belarusian ex military with strong reputation calling on all Belarusian forces to make a decision of a lifetime, be heroes and not follow the criminal orders they're being given. sorry no captions. GET THIS VIDEO TO ANONYMOUS ASAP, GET IT IN FRONT OF EVERY RUSSIAN AND BELARUSIAN YOU CAN. REVOLUTION!","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://reddit.com//r/RussiaUkraineWar2022/comments/t2rl80/belarusian_ex_military_with_strong_reputation/","comments":[]}]},{"timestamp":1645978675532,"author":"reddit:ukraine/Dabluealien233","title":"The real nazis","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://reddit.com//r/ukraine/comments/t2rlay/the_real_nazis/","comments":[]}]},{"timestamp":1645978696033,"author":"reddit:ukraine/Motor-Ad-8858","title":"Russia reports Ukraine uses phosphorus ammo in Kiev suburbs","content":"","comments":[{"author":"SYSTEM","title":"Post source","content":"https://reddit.com//r/ukraine/comments/t2rlm4/russia_reports_ukraine_uses_phosphorus_ammo_in/","comments":[]}]},{"timestamp":1645978705539,"author":"reddit:ukraine/PsychedelicAstroturf","title":"Russians are booby trapping flags.","content":"There has been footage of Russian separatists making booby traps using Russian flags so disguise them. Be weary of any flags you find laying about, whether it's Russian or Ukrainian. It could be a trap.","comments":[{"author":"SYSTEM","title":"Post source","content":"https://reddit.com//r/ukraine/comments/t2rlth/russians_are_booby_trapping_flags/","comments":[]}]},{"timestamp":1645978736699,"author":"reddit:ukraine/pokegeronimo","title":"Georgian bulker refused to give fuel to a Russian ship, saying \"Russian ship, go fuck yourself. You can row to shore.","content":"https://v.redd.it/msdv1cfxhek81","comments":[{"author":"SYSTEM","title":"Post source","content":"https://reddit.com//r/ukraine/comments/t2rl84/georgian_bulker_refused_to_give_fuel_to_a_russian/","comments":[]}]},{"timestamp":1645978746598,"author":"reddit:ukraine/Mr-Tiddles-","title":"After hearing the soldiers on the other side I think they need to know that they'll be allowed to surrender safely by Ukrainian forces.","content":"I'll try again, sorry I didn't realise the first time, so I hope this version is agreeable, but I feel it's an important sentiment to pass on.\n\nTo the invasive forces:\n\nDesert your positions, abandon those who keep leading you to die. Tie white rags around wrists, hands up above heads and march to your nearest Ukranian soldier. Shout your surrender loudly. Do not die to the will of a despot. It is not the Ukrainians intent on killing none combatants. A mad dog threatens nuclear retaliation due to economic sanctions and countries defending their sovereign lands against an invasion. Do the right thing. Surrender. Put the mad dog down.","comments":[{"author":"SYSTEM","title":"Post source","content":"https://reddit.com//r/ukraine/comments/t2rmap/after_hearing_the_soldiers_on_the_other_side_i/","comments":[]}]},{"timestamp":1645978746598,"author":"reddit:ukraine/BrushyBrushi","title":"What can dissenting Russian soldiers do in this situation?","content":"I assume there are lots of Russian soldiers who hates Putin just as much as everyone else, and have absolutely no desire to fight in this war, but what can these soldiers do in this situation in order to stall the Russian war effort?\n\nPut yourself in their situation, imagine that you are a Russian conscript who have been coerced into participating in this war. You are to afraid to rebel, or even talk openly about your dissenting views. Because there is a real threat of being shot as a traitor, or even your family back home can get in trouble. Your fellow soldiers are also close friends, so you don't want to betray them either. You know a few other soldiers who may share your beliefs, but you don't know if you can speak to them without them reporting you to the military police.\n\n&amp;#x200B;\n\nSo what are some ACTUAL options here?","comments":[{"author":"SYSTEM","title":"Post source","content":"https://reddit.com//r/ukraine/comments/t2rmcz/what_can_dissenting_russian_soldiers_do_in_this/","comments":[]}]},{"timestamp":1645978746598,"author":"reddit:ukraine/Square-Parfait-4617","title":"Seems you accidentally posted in the wrong subreddit (P.S not intended in anyway to break rule 5)","content":"https://i.redd.it/vcf6n5pbiek81.jpg","comments":[{"author":"SYSTEM","title":"Post source","content":"https://reddit.com//r/ukraine/comments/t2rmd6/seems_you_accidentally_posted_in_the_wrong/","comments":[]}]}]